gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORT0              (*(VPORT_t *) 0x0010) /* Virtual Port */
#define VPORT1              (*(VPORT_t *) 0x0014) /* Virtual Port */
#define VPORT2              (*(VPORT_t *) 0x0018) /* Virtual Port */
#define VPORT3              (*(VPORT_t *) 0x001C) /* Virtual Port */
#define OCD                   (*(OCD_t *) 0x002E) /* On-Chip Debug System */
#define CLK                   (*(CLK_t *) 0x0040) /* Clock System */
#define SLEEP               (*(SLEEP_t *) 0x0048) /* Sleep Controller */
#define OSC                   (*(OSC_t *) 0x0050) /* Oscillator */
#define DFLLRC32M            (*(DFLL_t *) 0x0060) /* DFLL */
#define PR                     (*(PR_t *) 0x0070) /* Power Reduction */
#define RST                   (*(RST_t *) 0x0078) /* Reset */
#define WDT                   (*(WDT_t *) 0x0080) /* Watch-Dog Timer */
#define MCU                   (*(MCU_t *) 0x0090) /* MCU Control */
#define PMIC                 (*(PMIC_t *) 0x00A0) /* Programmable Multi-level Interrupt Controller */
#define PORTCFG           (*(PORTCFG_t *) 0x00B0) /* I/O port Configuration */
#define NVM                   (*(NVM_t *) 0x01C0) /* Non-volatile Memory Controller */
#define PWR                   (*(PWR_t *) 0x01F0) /* Power Control */
#define RTC                   (*(RTC_t *) 0x0400) /* Real-Time Counter */
#define TWIC                  (*(TWI_t *) 0x0480) /* Two-Wire Interface */
#define PORTC                (*(PORT_t *) 0x0640) /* I/O Ports */
#define PORTH              (*(PORT_T_t *) 0x06E0) /* I/O Ports, disableable */
#define PORTJ              (*(PORT_T_t *) 0x0700) /* I/O Ports, disableable */
#define PORTK              (*(PORT_T_t *) 0x0720) /* I/O Ports, disableable */
#define PORTL              (*(PORT_T_t *) 0x0740) /* I/O Ports, disableable */
#define PORTM              (*(PORT_T_t *) 0x0760) /* I/O Ports, disableable */
#define PORTN              (*(PORT_T_t *) 0x0780) /* I/O Ports, disableable */
#define PORTP              (*(PORT_T_t *) 0x07A0) /* I/O Ports, disableable */
#define TCC0                  (*(TC0_t *) 0x0800) /* 16-bit Timer/Counter 0 */
#define TCC1                  (*(TC1_t *) 0x0840) /* 16-bit Timer/Counter 1 */
#define USARTC0             (*(USART_t *) 0x08A0) /* Universal Synchronous/Asynchronous Receiver/Transmitter */
#define SPIC                  (*(SPI_t *) 0x08C0) /* Serial Peripheral Interface */
#define CTE                   (*(CTE_t *) 0x0C00) /* CTE Module */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* GPIO - General Purpose IO Registers */
#define GPIO_GPIOR  _SFR_MEM8(0x0000)


/* Deprecated */
#define GPIO_GPIO  _SFR_MEM8(0x0000)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)


/* NVM_LOCKBITS (LOCKBIT) - Lock Bits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_RC32MCALB  _SFR_MEM8(0x0000)
#define PRODSIGNATURES_RC32MCALA  _SFR_MEM8(0x0001)
#define PRODSIGNATURES_FUSEBYTE1  _SFR_MEM8(0x0002)
#define PRODSIGNATURES_FUSE_EEH5  _SFR_MEM8(0x0003)
#define PRODSIGNATURES_RC32K  _SFR_MEM8(0x0004)
#define PRODSIGNATURES_FUSE_EEH6  _SFR_MEM8(0x0005)
#define PRODSIGNATURES_FUSEBYTE2  _SFR_MEM8(0x0006)
#define PRODSIGNATURES_FUSE_EEH4  _SFR_MEM8(0x0007)
#define PRODSIGNATURES_LOTNUM0  _SFR_MEM8(0x0008)
#define PRODSIGNATURES_LOTNUM1  _SFR_MEM8(0x0009)
#define PRODSIGNATURES_LOTNUM2  _SFR_MEM8(0x000A)
#define PRODSIGNATURES_LOTNUM3  _SFR_MEM8(0x000B)
#define PRODSIGNATURES_LOTNUM4  _SFR_MEM8(0x000C)
#define PRODSIGNATURES_LOTNUM5  _SFR_MEM8(0x000D)
#define PRODSIGNATURES_LOTNUM6  _SFR_MEM8(0x000E)
#define PRODSIGNATURES_LOTNUM7  _SFR_MEM8(0x000F)
#define PRODSIGNATURES_WAFNUM  _SFR_MEM8(0x0010)
#define PRODSIGNATURES_COORDX0  _SFR_MEM8(0x0012)
#define PRODSIGNATURES_COORDX1  _SFR_MEM8(0x0013)
#define PRODSIGNATURES_COORDY0  _SFR_MEM8(0x0014)
#define PRODSIGNATURES_COORDY1  _SFR_MEM8(0x0015)
#define PRODSIGNATURES_LOTNUM8  _SFR_MEM8(0x0016)
#define PRODSIGNATURES_LOTNUM9  _SFR_MEM8(0x0017)
#define PRODSIGNATURES_LOTNUM10  _SFR_MEM8(0x0018)
#define PRODSIGNATURES_LOTNUM11  _SFR_MEM8(0x0019)
#define PRODSIGNATURES_BGCAL0  _SFR_MEM8(0x0038)
#define PRODSIGNATURES_BGCAL1  _SFR_MEM8(0x0039)
#define PRODSIGNATURES_BGCAL2  _SFR_MEM8(0x003A)
#define PRODSIGNATURES_XLINE_BIAS_250_H  _SFR_MEM8(0x003C)
#define PRODSIGNATURES_XLINE_BIAS_250_L  _SFR_MEM8(0x003D)
#define PRODSIGNATURES_XLINE_BIAS_350_H  _SFR_MEM8(0x003E)
#define PRODSIGNATURES_XLINE_BIAS_350_L  _SFR_MEM8(0x003F)
#define PRODSIGNATURES_XLINE_BIAS_500_H  _SFR_MEM8(0x0040)
#define PRODSIGNATURES_XLINE_BIAS_500_L  _SFR_MEM8(0x0041)
#define PRODSIGNATURES_YLINE_INT_BIAS  _SFR_MEM8(0x0042)
#define PRODSIGNATURES_YLINE_INT_CAP  _SFR_MEM8(0x0043)
#define PRODSIGNATURES_ADC10_CAL  _SFR_MEM8(0x0044)
#define PRODSIGNATURES_ADCSHVBCALH  _SFR_MEM8(0x0045)
#define PRODSIGNATURES_ADCSHVBCALL  _SFR_MEM8(0x0046)
#define PRODSIGNATURES_YLINE_INT_BIAS_150  _SFR_MEM8(0x0047)
#define PRODSIGNATURES_UID0_RANDOM_BYTE0  _SFR_MEM8(0x0050)
#define PRODSIGNATURES_UID0_RANDOM_BYTE1  _SFR_MEM8(0x0051)
#define PRODSIGNATURES_UID2_IP_HASH_BYTE0  _SFR_MEM8(0x0052)
#define PRODSIGNATURES_UID3_SITE  _SFR_MEM8(0x0053)
#define PRODSIGNATURES_UID3_UTC_Byte0  _SFR_MEM8(0x0054)
#define PRODSIGNATURES_UID4_UTC_Byte1  _SFR_MEM8(0x0055)
#define PRODSIGNATURES_UID5_UTC_Byte2  _SFR_MEM8(0x0056)
#define PRODSIGNATURES_UID6_UTC_Byte3  _SFR_MEM8(0x0057)
#define PRODSIGNATURES_BGEXTREME0_WS  _SFR_MEM8(0x00AC)
#define PRODSIGNATURES_BGEXTREME1_WS  _SFR_MEM8(0x00AD)
#define PRODSIGNATURES_BGEXTREME2_WS  _SFR_MEM8(0x00AE)
#define PRODSIGNATURES_BGEXTREME3_WS  _SFR_MEM8(0x00AF)
#define PRODSIGNATURES_CRCMASKL  _SFR_MEM8(0x00FE)
#define PRODSIGNATURES_CRCMASKH  _SFR_MEM8(0x00FF)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


