gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
#define CTE_PADSCY5H  _SFR_MEM8(0x0D8B)
#define CTE_PADSCY6  _SFR_MEM16(0x0D8C)
#define CTE_PADSCY6L  _SFR_MEM8(0x0D8C)
#define CTE_PADSCY6H  _SFR_MEM8(0x0D8D)
#define CTE_PADSCY7  _SFR_MEM16(0x0D8E)
#define CTE_PADSCY7L  _SFR_MEM8(0x0D8E)
#define CTE_PADSCY7H  _SFR_MEM8(0x0D8F)
#define CTE_PADSCY8  _SFR_MEM16(0x0D90)
#define CTE_PADSCY8L  _SFR_MEM8(0x0D90)
#define CTE_PADSCY8H  _SFR_MEM8(0x0D91)
#define CTE_PADSCY9  _SFR_MEM16(0x0D92)
#define CTE_PADSCY9L  _SFR_MEM8(0x0D92)
#define CTE_PADSCY9H  _SFR_MEM8(0x0D93)
#define CTE_PADSCY10  _SFR_MEM16(0x0D94)
#define CTE_PADSCY10L  _SFR_MEM8(0x0D94)
#define CTE_PADSCY10H  _SFR_MEM8(0x0D95)
#define CTE_PADSCY11  _SFR_MEM16(0x0D96)
#define CTE_PADSCY11L  _SFR_MEM8(0x0D96)
#define CTE_PADSCY11H  _SFR_MEM8(0x0D97)
#define CTE_PADSCY12  _SFR_MEM16(0x0D98)
#define CTE_PADSCY12L  _SFR_MEM8(0x0D98)
#define CTE_PADSCY12H  _SFR_MEM8(0x0D99)
#define CTE_PADSCY13  _SFR_MEM16(0x0D9A)
#define CTE_PADSCY13L  _SFR_MEM8(0x0D9A)
#define CTE_PADSCY13H  _SFR_MEM8(0x0D9B)
#define CTE_PADSCY14  _SFR_MEM16(0x0D9C)
#define CTE_PADSCY14L  _SFR_MEM8(0x0D9C)
#define CTE_PADSCY14H  _SFR_MEM8(0x0D9D)
#define CTE_PADSCY15  _SFR_MEM16(0x0D9E)
#define CTE_PADSCY15L  _SFR_MEM8(0x0D9E)
#define CTE_PADSCY15H  _SFR_MEM8(0x0D9F)
#define CTE_PADSCY16  _SFR_MEM16(0x0DA0)
#define CTE_PADSCY16L  _SFR_MEM8(0x0DA0)
#define CTE_PADSCY16H  _SFR_MEM8(0x0DA1)
#define CTE_PADSCY17  _SFR_MEM16(0x0DA2)
#define CTE_PADSCY17L  _SFR_MEM8(0x0DA2)
#define CTE_PADSCY17H  _SFR_MEM8(0x0DA3)
#define CTE_PADSCY18  _SFR_MEM16(0x0DA4)
#define CTE_PADSCY18L  _SFR_MEM8(0x0DA4)
#define CTE_PADSCY18H  _SFR_MEM8(0x0DA5)
#define CTE_PADSCY19  _SFR_MEM16(0x0DA6)
#define CTE_PADSCY19L  _SFR_MEM8(0x0DA6)
#define CTE_PADSCY19H  _SFR_MEM8(0x0DA7)
#define CTE_PADSCY20  _SFR_MEM16(0x0DA8)
#define CTE_PADSCY20L  _SFR_MEM8(0x0DA8)
#define CTE_PADSCY20H  _SFR_MEM8(0x0DA9)
#define CTE_PADSCY21  _SFR_MEM16(0x0DAA)
#define CTE_PADSCY21L  _SFR_MEM8(0x0DAA)
#define CTE_PADSCY21H  _SFR_MEM8(0x0DAB)
#define CTE_PADSCY22  _SFR_MEM16(0x0DAC)
#define CTE_PADSCY22L  _SFR_MEM8(0x0DAC)
#define CTE_PADSCY22H  _SFR_MEM8(0x0DAD)
#define CTE_PADSCY23  _SFR_MEM16(0x0DAE)
#define CTE_PADSCY23L  _SFR_MEM8(0x0DAE)
#define CTE_PADSCY23H  _SFR_MEM8(0x0DAF)
#define CTE_PADSCY24  _SFR_MEM16(0x0DB0)
#define CTE_PADSCY24L  _SFR_MEM8(0x0DB0)
#define CTE_PADSCY24H  _SFR_MEM8(0x0DB1)
#define CTE_PADSCY25  _SFR_MEM16(0x0DB2)
#define CTE_PADSCY25L  _SFR_MEM8(0x0DB2)
#define CTE_PADSCY25H  _SFR_MEM8(0x0DB3)
#define CTE_PADSCY26  _SFR_MEM16(0x0DB4)
#define CTE_PADSCY26L  _SFR_MEM8(0x0DB4)
#define CTE_PADSCY26H  _SFR_MEM8(0x0DB5)
#define CTE_PADSCY27  _SFR_MEM16(0x0DB6)
#define CTE_PADSCY27L  _SFR_MEM8(0x0DB6)
#define CTE_PADSCY27H  _SFR_MEM8(0x0DB7)
#define CTE_PADSCY28  _SFR_MEM16(0x0DB8)
#define CTE_PADSCY28L  _SFR_MEM8(0x0DB8)
#define CTE_PADSCY28H  _SFR_MEM8(0x0DB9)
#define CTE_PADSCY29  _SFR_MEM16(0x0DBA)
#define CTE_PADSCY29L  _SFR_MEM8(0x0DBA)
#define CTE_PADSCY29H  _SFR_MEM8(0x0DBB)
#define CTE_PADSCY30  _SFR_MEM16(0x0DBC)
#define CTE_PADSCY30L  _SFR_MEM8(0x0DBC)
#define CTE_PADSCY30H  _SFR_MEM8(0x0DBD)
#define CTE_PADSCY31  _SFR_MEM16(0x0DBE)
#define CTE_PADSCY31L  _SFR_MEM8(0x0DBE)
#define CTE_PADSCY31H  _SFR_MEM8(0x0DBF)
#define CTE_PADSCY32  _SFR_MEM16(0x0DC0)
#define CTE_PADSCY32L  _SFR_MEM8(0x0DC0)
#define CTE_PADSCY32H  _SFR_MEM8(0x0DC1)
#define CTE_PADSCY33  _SFR_MEM16(0x0DC2)
#define CTE_PADSCY33L  _SFR_MEM8(0x0DC2)
#define CTE_PADSCY33H  _SFR_MEM8(0x0DC3)
#define CTE_PADSCY34  _SFR_MEM16(0x0DC4)
#define CTE_PADSCY34L  _SFR_MEM8(0x0DC4)
#define CTE_PADSCY34H  _SFR_MEM8(0x0DC5)
#define CTE_PADSCY35  _SFR_MEM16(0x0DC6)
#define CTE_PADSCY35L  _SFR_MEM8(0x0DC6)
#define CTE_PADSCY35H  _SFR_MEM8(0x0DC7)
#define CTE_PADHVSWENA  _SFR_MEM16(0x0DD0)
#define CTE_PADHVSWENAL  _SFR_MEM8(0x0DD0)
#define CTE_PADHVSWENAH  _SFR_MEM8(0x0DD1)
#define CTE_PADHVSWENB  _SFR_MEM16(0x0DD2)
#define CTE_PADHVSWENBL  _SFR_MEM8(0x0DD2)
#define CTE_PADHVSWENBH  _SFR_MEM8(0x0DD3)
#define CTE_PADBNX1  _SFR_MEM16(0x0DD4)
#define CTE_PADBNX1L  _SFR_MEM8(0x0DD4)
#define CTE_PADBNX1H  _SFR_MEM8(0x0DD5)
#define CTE_PADBPX1  _SFR_MEM16(0x0DD6)
#define CTE_PADBPX1L  _SFR_MEM8(0x0DD6)
#define CTE_PADBPX1H  _SFR_MEM8(0x0DD7)
#define CTE_PADX1  _SFR_MEM16(0x0DD8)
#define CTE_PADX1L  _SFR_MEM8(0x0DD8)
#define CTE_PADX1H  _SFR_MEM8(0x0DD9)
#define CTE_PADBNX2  _SFR_MEM16(0x0DDA)
#define CTE_PADBNX2L  _SFR_MEM8(0x0DDA)
#define CTE_PADBNX2H  _SFR_MEM8(0x0DDB)
#define CTE_PADBPX2  _SFR_MEM16(0x0DDC)
#define CTE_PADBPX2L  _SFR_MEM8(0x0DDC)
#define CTE_PADBPX2H  _SFR_MEM8(0x0DDD)
#define CTE_PADX2  _SFR_MEM16(0x0DDE)
#define CTE_PADX2L  _SFR_MEM8(0x0DDE)
#define CTE_PADX2H  _SFR_MEM8(0x0DDF)
#define CTE_PADSCTESTENA  _SFR_MEM16(0x0DE0)
#define CTE_PADSCTESTENAL  _SFR_MEM8(0x0DE0)
#define CTE_PADSCTESTENAH  _SFR_MEM8(0x0DE1)
#define CTE_PADSCTESTENB  _SFR_MEM16(0x0DE2)
#define CTE_PADSCTESTENBL  _SFR_MEM8(0x0DE2)
#define CTE_PADSCTESTENBH  _SFR_MEM8(0x0DE3)
#define CTE_GCAFCRA  _SFR_MEM16(0x0E00)
#define CTE_GCAFCRAL  _SFR_MEM8(0x0E00)
#define CTE_GCAFCRAH  _SFR_MEM8(0x0E01)
#define CTE_GCAFCRB  _SFR_MEM16(0x0E02)
#define CTE_GCAFCRBL  _SFR_MEM8(0x0E02)
#define CTE_GCAFCRBH  _SFR_MEM8(0x0E03)
#define CTE_GCAFMCENA  _SFR_MEM16(0x0E04)
#define CTE_GCAFMCENAL  _SFR_MEM8(0x0E04)
#define CTE_GCAFMCENAH  _SFR_MEM8(0x0E05)
#define CTE_GCAFMCENB  _SFR_MEM16(0x0E06)
#define CTE_GCAFMCENBL  _SFR_MEM8(0x0E06)
#define CTE_GCAFMCENBH  _SFR_MEM8(0x0E07)
#define CTE_GCAFBASELIM  _SFR_MEM16(0x0E08)
#define CTE_GCAFBASELIML  _SFR_MEM8(0x0E08)
#define CTE_GCAFBASELIMH  _SFR_MEM8(0x0E09)
#define CTE_GCAFPCLL  _SFR_MEM16(0x0E0A)
#define CTE_GCAFPCLLL  _SFR_MEM8(0x0E0A)
#define CTE_GCAFPCLLH  _SFR_MEM8(0x0E0B)
#define CTE_GCAFPCUL  _SFR_MEM16(0x0E0C)
#define CTE_GCAFPCULL  _SFR_MEM8(0x0E0C)
#define CTE_GCAFPCULH  _SFR_MEM8(0x0E0D)
#define CTE_GCAFWFCR  _SFR_MEM16(0x0E0E)
#define CTE_GCAFWFCRL  _SFR_MEM8(0x0E0E)
#define CTE_GCAFWFCRH  _SFR_MEM8(0x0E0F)
#define CTE_GCAFADCMIN  _SFR_MEM16(0x0E10)
#define CTE_GCAFADCMINL  _SFR_MEM8(0x0E10)
#define CTE_GCAFADCMINH  _SFR_MEM8(0x0E11)
#define CTE_GCAFADCMAX  _SFR_MEM16(0x0E12)
#define CTE_GCAFADCMAXL  _SFR_MEM8(0x0E12)
#define CTE_GCAFADCMAXH  _SFR_MEM8(0x0E13)
#define CTE_PIFXENA  _SFR_MEM16(0x0E40)
#define CTE_PIFXENAL  _SFR_MEM8(0x0E40)
#define CTE_PIFXENAH  _SFR_MEM8(0x0E41)
#define CTE_PIFXENB  _SFR_MEM16(0x0E42)
#define CTE_PIFXENBL  _SFR_MEM8(0x0E42)
#define CTE_PIFXENBH  _SFR_MEM8(0x0E43)
#define CTE_PIFYENA  _SFR_MEM16(0x0E44)
#define CTE_PIFYENAL  _SFR_MEM8(0x0E44)
#define CTE_PIFYENAH  _SFR_MEM8(0x0E45)
#define CTE_PIFYENB  _SFR_MEM16(0x0E46)
#define CTE_PIFYENBL  _SFR_MEM8(0x0E46)
#define CTE_PIFYENBH  _SFR_MEM8(0x0E47)
#define CTE_PIFXPINA  _SFR_MEM16(0x0E48)
#define CTE_PIFXPINAL  _SFR_MEM8(0x0E48)
#define CTE_PIFXPINAH  _SFR_MEM8(0x0E49)
#define CTE_PIFXPINB  _SFR_MEM16(0x0E4A)
#define CTE_PIFXPINBL  _SFR_MEM8(0x0E4A)
#define CTE_PIFXPINBH  _SFR_MEM8(0x0E4B)
#define CTE_PIFYPINA  _SFR_MEM16(0x0E4C)
#define CTE_PIFYPINAL  _SFR_MEM8(0x0E4C)
#define CTE_PIFYPINAH  _SFR_MEM8(0x0E4D)
#define CTE_PIFYPINB  _SFR_MEM16(0x0E4E)
#define CTE_PIFYPINBL  _SFR_MEM8(0x0E4E)
#define CTE_PIFYPINBH  _SFR_MEM8(0x0E4F)
#define CTE_PIFXSRLA  _SFR_MEM16(0x0E50)
#define CTE_PIFXSRLAL  _SFR_MEM8(0x0E50)
#define CTE_PIFXSRLAH  _SFR_MEM8(0x0E51)
#define CTE_PIFXSRLB  _SFR_MEM16(0x0E52)
#define CTE_PIFXSRLBL  _SFR_MEM8(0x0E52)
#define CTE_PIFXSRLBH  _SFR_MEM8(0x0E53)
#define CTE_PIFYSRLA  _SFR_MEM16(0x0E54)
#define CTE_PIFYSRLAL  _SFR_MEM8(0x0E54)
#define CTE_PIFYSRLAH  _SFR_MEM8(0x0E55)
#define CTE_PIFYSRLB  _SFR_MEM16(0x0E56)
#define CTE_PIFYSRLBL  _SFR_MEM8(0x0E56)
#define CTE_PIFYSRLBH  _SFR_MEM8(0x0E57)
#define CTE_MS0PCL  _SFR_MEM8(0x0F80)
#define CTE_MS0PCH  _SFR_MEM8(0x0F81)
#define CTE_MS0HIF  _SFR_MEM8(0x0F82)
#define CTE_MS0IR0  _SFR_MEM8(0x0F84)
#define CTE_MS0IR1  _SFR_MEM8(0x0F85)
#define CTE_MS0IR2  _SFR_MEM8(0x0F86)
#define CTE_MS0IR3  _SFR_MEM8(0x0F87)
#define CTE_MS0IRBUFL  _SFR_MEM8(0x0F88)
#define CTE_MS0IRBUFH  _SFR_MEM8(0x0F89)
#define CTE_MS0R0L  _SFR_MEM8(0x0F8A)
#define CTE_MS0R0H  _SFR_MEM8(0x0F8B)
#define CTE_MS0REPEATL  _SFR_MEM8(0x0F8C)
#define CTE_MS0REPEATH  _SFR_MEM8(0x0F8D)
#define CTE_MS1PCL  _SFR_MEM8(0x0F90)
#define CTE_MS1PCH  _SFR_MEM8(0x0F91)
#define CTE_MS1HIF  _SFR_MEM8(0x0F92)
#define CTE_MS1IR0  _SFR_MEM8(0x0F94)
#define CTE_MS1IR1  _SFR_MEM8(0x0F95)
#define CTE_MS1IR2  _SFR_MEM8(0x0F96)
#define CTE_MS1IR3  _SFR_MEM8(0x0F97)
#define CTE_MS1IRBUFL  _SFR_MEM8(0x0F98)
#define CTE_MS1IRBUFH  _SFR_MEM8(0x0F99)
#define CTE_MS1R0L  _SFR_MEM8(0x0F9A)
#define CTE_MS1R0H  _SFR_MEM8(0x0F9B)
#define CTE_MS1REPEATL  _SFR_MEM8(0x0F9C)
#define CTE_MS1REPEATH  _SFR_MEM8(0x0F9D)
#define CTE_CTTEMP  _SFR_MEM8(0x0FA0)
#define CTE_CTCRA  _SFR_MEM8(0x0FA1)
#define CTE_DMAPSCLR  _SFR_MEM8(0x0FA2)
#define CTE_DMAPSSET  _SFR_MEM8(0x0FA3)
#define CTE_MS0_MSACCAL  _SFR_MEM16(0x0E80)
#define CTE_MS0_MSACCAH  _SFR_MEM16(0x0E82)
#define CTE_MS0_MSACCBL  _SFR_MEM16(0x0E84)
#define CTE_MS0_MSACCBH  _SFR_MEM16(0x0E86)
#define CTE_MS0_MSACCCNTA  _SFR_MEM16(0x0E88)
#define CTE_MS0_MSACCCNTB  _SFR_MEM16(0x0E8A)
#define CTE_MS0_MSMAXA  _SFR_MEM16(0x0E8C)
#define CTE_MS0_MSMAXB  _SFR_MEM16(0x0E8E)
#define CTE_MS0_MSMINA  _SFR_MEM16(0x0E90)
#define CTE_MS0_MSMINB  _SFR_MEM16(0x0E92)
#define CTE_MS0_MSSHIFTRA  _SFR_MEM16(0x0E94)
#define CTE_MS0_MSSHIFTRB  _SFR_MEM16(0x0E96)
#define CTE_MS0_MSACCSR  _SFR_MEM16(0x0E98)
#define CTE_MS0_MSCRCCLR  _SFR_MEM16(0x0E9A)
#define CTE_MS0_MSCRCSET  _SFR_MEM16(0x0E9C)
#define CTE_MS0_MSCRA  _SFR_MEM16(0x0EE0)
#define CTE_MS0_MSCRB  _SFR_MEM16(0x0EE2)
#define CTE_MS0_MSSRACLR  _SFR_MEM16(0x0EE8)
#define CTE_MS0_MSSRASET  _SFR_MEM16(0x0EEA)
#define CTE_MS0_MSSRB  _SFR_MEM16(0x0EEC)
#define CTE_MS0_MSSRC  _SFR_MEM16(0x0EEE)
#define CTE_MS0_MSSRD  _SFR_MEM16(0x0EF0)
#define CTE_MS0_MSSRE  _SFR_MEM16(0x0EF2)
#define CTE_MS0_MSCCR  _SFR_MEM16(0x0EF4)
#define CTE_MS0_MSLINK  _SFR_MEM16(0x0EFA)


#define CTE_MS1_MSACCAL  _SFR_MEM16(0x0F00)
#define CTE_MS1_MSACCAH  _SFR_MEM16(0x0F02)
#define CTE_MS1_MSACCBL  _SFR_MEM16(0x0F04)
#define CTE_MS1_MSACCBH  _SFR_MEM16(0x0F06)
#define CTE_MS1_MSACCCNTA  _SFR_MEM16(0x0F08)
#define CTE_MS1_MSACCCNTB  _SFR_MEM16(0x0F0A)
#define CTE_MS1_MSMAXA  _SFR_MEM16(0x0F0C)
#define CTE_MS1_MSMAXB  _SFR_MEM16(0x0F0E)
#define CTE_MS1_MSMINA  _SFR_MEM16(0x0F10)
#define CTE_MS1_MSMINB  _SFR_MEM16(0x0F12)
#define CTE_MS1_MSSHIFTRA  _SFR_MEM16(0x0F14)
#define CTE_MS1_MSSHIFTRB  _SFR_MEM16(0x0F16)
#define CTE_MS1_MSACCSR  _SFR_MEM16(0x0F18)
#define CTE_MS1_MSCRCCLR  _SFR_MEM16(0x0F1A)
#define CTE_MS1_MSCRCSET  _SFR_MEM16(0x0F1C)
#define CTE_MS1_MSCRA  _SFR_MEM16(0x0F60)
#define CTE_MS1_MSCRB  _SFR_MEM16(0x0F62)
#define CTE_MS1_MSSRACLR  _SFR_MEM16(0x0F68)
#define CTE_MS1_MSSRASET  _SFR_MEM16(0x0F6A)
#define CTE_MS1_MSSRB  _SFR_MEM16(0x0F6C)
#define CTE_MS1_MSSRC  _SFR_MEM16(0x0F6E)
#define CTE_MS1_MSSRD  _SFR_MEM16(0x0F70)
#define CTE_MS1_MSSRE  _SFR_MEM16(0x0F72)
#define CTE_MS1_MSCCR  _SFR_MEM16(0x0F74)
#define CTE_MS1_MSLINK  _SFR_MEM16(0x0F7A)





/*================== Bitfield Definitions ================== */

/* CLK - Clock System */
/* CLK.CTRL  bit masks and bit positions */
#define CLK_SCLKSEL_gm  0x07  /* System Clock Selection group mask. */
#define CLK_SCLKSEL_gp  0  /* System Clock Selection group position. */
#define CLK_SCLKSEL0_bm  (1<<0)  /* System Clock Selection bit 0 mask. */
#define CLK_SCLKSEL0_bp  0  /* System Clock Selection bit 0 position. */
#define CLK_SCLKSEL1_bm  (1<<1)  /* System Clock Selection bit 1 mask. */
#define CLK_SCLKSEL1_bp  1  /* System Clock Selection bit 1 position. */
#define CLK_SCLKSEL2_bm  (1<<2)  /* System Clock Selection bit 2 mask. */
#define CLK_SCLKSEL2_bp  2  /* System Clock Selection bit 2 position. */

/* CLK.PSCTRL  bit masks and bit positions */
#define CLK_PSBCDIV_gm  0x03  /* Prescaler B and C Division factor group mask. */
#define CLK_PSBCDIV_gp  0  /* Prescaler B and C Division factor group position. */
#define CLK_PSBCDIV0_bm  (1<<0)  /* Prescaler B and C Division factor bit 0 mask. */
#define CLK_PSBCDIV0_bp  0  /* Prescaler B and C Division factor bit 0 position. */
#define CLK_PSBCDIV1_bm  (1<<1)  /* Prescaler B and C Division factor bit 1 mask. */
#define CLK_PSBCDIV1_bp  1  /* Prescaler B and C Division factor bit 1 position. */
#define CLK_PSADIV_gm  0x7C  /* Prescaler A Division Factor group mask. */
#define CLK_PSADIV_gp  2  /* Prescaler A Division Factor group position. */
#define CLK_PSADIV0_bm  (1<<2)  /* Prescaler A Division Factor bit 0 mask. */
#define CLK_PSADIV0_bp  2  /* Prescaler A Division Factor bit 0 position. */
#define CLK_PSADIV1_bm  (1<<3)  /* Prescaler A Division Factor bit 1 mask. */
#define CLK_PSADIV1_bp  3  /* Prescaler A Division Factor bit 1 position. */
#define CLK_PSADIV2_bm  (1<<4)  /* Prescaler A Division Factor bit 2 mask. */
#define CLK_PSADIV2_bp  4  /* Prescaler A Division Factor bit 2 position. */
#define CLK_PSADIV3_bm  (1<<5)  /* Prescaler A Division Factor bit 3 mask. */
#define CLK_PSADIV3_bp  5  /* Prescaler A Division Factor bit 3 position. */
#define CLK_PSADIV4_bm  (1<<6)  /* Prescaler A Division Factor bit 4 mask. */
#define CLK_PSADIV4_bp  6  /* Prescaler A Division Factor bit 4 position. */

/* CLK.LOCK  bit masks and bit positions */
#define CLK_LOCK_bm  0x01  /* Clock System Lock bit mask. */
#define CLK_LOCK_bp  0  /* Clock System Lock bit position. */

