gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CLK.RTCCTRL  bit masks and bit positions */
#define CLK_RTCEN_bm  0x01  /* RTC Clock Source Enable bit mask. */
#define CLK_RTCEN_bp  0  /* RTC Clock Source Enable bit position. */
#define CLK_RTCSRC_gm  0x0E  /* RTC Clock Source group mask. */
#define CLK_RTCSRC_gp  1  /* RTC Clock Source group position. */
#define CLK_RTCSRC0_bm  (1<<1)  /* RTC Clock Source bit 0 mask. */
#define CLK_RTCSRC0_bp  1  /* RTC Clock Source bit 0 position. */
#define CLK_RTCSRC1_bm  (1<<2)  /* RTC Clock Source bit 1 mask. */
#define CLK_RTCSRC1_bp  2  /* RTC Clock Source bit 1 position. */
#define CLK_RTCSRC2_bm  (1<<3)  /* RTC Clock Source bit 2 mask. */
#define CLK_RTCSRC2_bp  3  /* RTC Clock Source bit 2 position. */

/* PR.PRGEN  bit masks and bit positions */
#define PR_DMA_bm  0x01  /* DMA-Controller bit mask. */
#define PR_DMA_bp  0  /* DMA-Controller bit position. */
#define PR_EVSYS_bm  0x02  /* Event System bit mask. */
#define PR_EVSYS_bp  1  /* Event System bit position. */
#define PR_RTC_bm  0x04  /* Real-time Counter bit mask. */
#define PR_RTC_bp  2  /* Real-time Counter bit position. */
#define PR_EBI_bm  0x08  /* External Bus Interface bit mask. */
#define PR_EBI_bp  3  /* External Bus Interface bit position. */
#define PR_AES_bm  0x10  /* AES bit mask. */
#define PR_AES_bp  4  /* AES bit position. */
#define PR_CTM_bm  0x20  /* CTM bit mask. */
#define PR_CTM_bp  5  /* CTM bit position. */

/* PR.PRPA  bit masks and bit positions */
#define PR_AC_bm  0x01  /* Port A Analog Comparator bit mask. */
#define PR_AC_bp  0  /* Port A Analog Comparator bit position. */
#define PR_ADC_bm  0x02  /* Port A ADC bit mask. */
#define PR_ADC_bp  1  /* Port A ADC bit position. */
#define PR_DAC_bm  0x04  /* Port A DAC bit mask. */
#define PR_DAC_bp  2  /* Port A DAC bit position. */

/* PR.PRPB  bit masks and bit positions */
/* PR_AC  is already defined. */
/* PR_ADC  is already defined. */
/* PR_DAC  is already defined. */

/* PR.PRPC  bit masks and bit positions */
#define PR_TC0_bm  0x01  /* Port C Timer/Counter0 bit mask. */
#define PR_TC0_bp  0  /* Port C Timer/Counter0 bit position. */
#define PR_TC1_bm  0x02  /* Port C Timer/Counter1 bit mask. */
#define PR_TC1_bp  1  /* Port C Timer/Counter1 bit position. */
#define PR_HIRES_bm  0x04  /* Port C AWEX bit mask. */
#define PR_HIRES_bp  2  /* Port C AWEX bit position. */
#define PR_SPI_bm  0x08  /* Port C SPI bit mask. */
#define PR_SPI_bp  3  /* Port C SPI bit position. */
#define PR_USART0_bm  0x10  /* Port C USART0 bit mask. */
#define PR_USART0_bp  4  /* Port C USART0 bit position. */
#define PR_USART1_bm  0x20  /* Port C USART1 bit mask. */
#define PR_USART1_bp  5  /* Port C USART1 bit position. */
#define PR_TWI_bm  0x40  /* Port C Two-wire Interface bit mask. */
#define PR_TWI_bp  6  /* Port C Two-wire Interface bit position. */

/* PR.PRPD  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PR.PRPE  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PR.PRPF  bit masks and bit positions */
/* PR_TC0  is already defined. */
/* PR_TC1  is already defined. */
/* PR_HIRES  is already defined. */
/* PR_SPI  is already defined. */
/* PR_USART0  is already defined. */
/* PR_USART1  is already defined. */
/* PR_TWI  is already defined. */

/* PWR.PWRCR  bit masks and bit positions */
#define PWR_PWRLVLSEN_bm  0x01  /* Power Control Level Shifter Enable bit mask. */
#define PWR_PWRLVLSEN_bp  0  /* Power Control Level Shifter Enable bit position. */
#define PWR_PWRLVLSDIS_bm  0x02  /* Power Control Level Shifter Disable bit mask. */
#define PWR_PWRLVLSDIS_bp  1  /* Power Control Level Shifter Disable bit position. */
#define PWR_PWRBODEN_bm  0x80  /* Power Control BOD Enable bit mask. */
#define PWR_PWRBODEN_bp  7  /* Power Control BOD Enable bit position. */

/* PWR.PWRSR  bit masks and bit positions */
#define PWR_PWROK_bm  0x01  /* Power OK bit mask. */
#define PWR_PWROK_bp  0  /* Power OK bit position. */
#define PWR_PWRRSTDONE_bm  0x02  /* Power Control Reset Done bit mask. */
#define PWR_PWRRSTDONE_bp  1  /* Power Control Reset Done bit position. */
#define PWR_PWRLVLSS_bm  0x04  /* Power Controller Levelshifter Status bit mask. */
#define PWR_PWRLVLSS_bp  2  /* Power Controller Levelshifter Status bit position. */

/* PWR.PWRCRVDDIO  bit masks and bit positions */
/* PWR_PWRLVLSEN  is already defined. */
/* PWR_PWRLVLSDIS  is already defined. */
/* PWR_PWRBODEN  is already defined. */

/* PWR.PWRSRVDDIO  bit masks and bit positions */
/* PWR_PWROK  is already defined. */
/* PWR_PWRRSTDONE  is already defined. */
/* PWR_PWRLVLSS  is already defined. */

/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP7_bp  7  /* CCP signature bit 7 position. */








/* CPU.SREG  bit masks and bit positions */
#define CPU_C_bm  0x01  /* Carry Flag bit mask. */
#define CPU_C_bp  0  /* Carry Flag bit position. */
#define CPU_Z_bm  0x02  /* Zero Flag bit mask. */
#define CPU_Z_bp  1  /* Zero Flag bit position. */
#define CPU_N_bm  0x04  /* Negative Flag bit mask. */
#define CPU_N_bp  2  /* Negative Flag bit position. */
#define CPU_V_bm  0x08  /* Two's Complement Overflow Flag bit mask. */
#define CPU_V_bp  3  /* Two's Complement Overflow Flag bit position. */
#define CPU_S_bm  0x10  /* N Exclusive Or V Flag bit mask. */
#define CPU_S_bp  4  /* N Exclusive Or V Flag bit position. */
#define CPU_H_bm  0x20  /* Half Carry Flag bit mask. */
#define CPU_H_bp  5  /* Half Carry Flag bit position. */
#define CPU_T_bm  0x40  /* Transfer Bit bit mask. */
#define CPU_T_bp  6  /* Transfer Bit bit position. */
#define CPU_I_bm  0x80  /* Global Interrupt Enable Flag bit mask. */
#define CPU_I_bp  7  /* Global Interrupt Enable Flag bit position. */

/* CTE - CTE Module */
/* CTEMS.MSACCAL  bit masks and bit positions */
#define CTEMS_MSACCA_gm  0xFFFF  /* MS Accumulator A group mask. */
#define CTEMS_MSACCA_gp  0  /* MS Accumulator A group position. */
#define CTEMS_MSACCA0_bm  (1<<0)  /* MS Accumulator A bit 0 mask. */
#define CTEMS_MSACCA0_bp  0  /* MS Accumulator A bit 0 position. */
#define CTEMS_MSACCA1_bm  (1<<1)  /* MS Accumulator A bit 1 mask. */
#define CTEMS_MSACCA1_bp  1  /* MS Accumulator A bit 1 position. */
#define CTEMS_MSACCA2_bm  (1<<2)  /* MS Accumulator A bit 2 mask. */
#define CTEMS_MSACCA2_bp  2  /* MS Accumulator A bit 2 position. */
#define CTEMS_MSACCA3_bm  (1<<3)  /* MS Accumulator A bit 3 mask. */
#define CTEMS_MSACCA3_bp  3  /* MS Accumulator A bit 3 position. */
#define CTEMS_MSACCA4_bm  (1<<4)  /* MS Accumulator A bit 4 mask. */
#define CTEMS_MSACCA4_bp  4  /* MS Accumulator A bit 4 position. */
#define CTEMS_MSACCA5_bm  (1<<5)  /* MS Accumulator A bit 5 mask. */
#define CTEMS_MSACCA5_bp  5  /* MS Accumulator A bit 5 position. */
#define CTEMS_MSACCA6_bm  (1<<6)  /* MS Accumulator A bit 6 mask. */
#define CTEMS_MSACCA6_bp  6  /* MS Accumulator A bit 6 position. */
#define CTEMS_MSACCA7_bm  (1<<7)  /* MS Accumulator A bit 7 mask. */
#define CTEMS_MSACCA7_bp  7  /* MS Accumulator A bit 7 position. */
#define CTEMS_MSACCA8_bm  (1<<8)  /* MS Accumulator A bit 8 mask. */
#define CTEMS_MSACCA8_bp  8  /* MS Accumulator A bit 8 position. */
#define CTEMS_MSACCA9_bm  (1<<9)  /* MS Accumulator A bit 9 mask. */
#define CTEMS_MSACCA9_bp  9  /* MS Accumulator A bit 9 position. */
#define CTEMS_MSACCA10_bm  (1<<10)  /* MS Accumulator A bit 10 mask. */
#define CTEMS_MSACCA10_bp  10  /* MS Accumulator A bit 10 position. */
#define CTEMS_MSACCA11_bm  (1<<11)  /* MS Accumulator A bit 11 mask. */
#define CTEMS_MSACCA11_bp  11  /* MS Accumulator A bit 11 position. */
#define CTEMS_MSACCA12_bm  (1<<12)  /* MS Accumulator A bit 12 mask. */
#define CTEMS_MSACCA12_bp  12  /* MS Accumulator A bit 12 position. */
#define CTEMS_MSACCA13_bm  (1<<13)  /* MS Accumulator A bit 13 mask. */
#define CTEMS_MSACCA13_bp  13  /* MS Accumulator A bit 13 position. */
#define CTEMS_MSACCA14_bm  (1<<14)  /* MS Accumulator A bit 14 mask. */
#define CTEMS_MSACCA14_bp  14  /* MS Accumulator A bit 14 position. */
#define CTEMS_MSACCA15_bm  (1<<15)  /* MS Accumulator A bit 15 mask. */
#define CTEMS_MSACCA15_bp  15  /* MS Accumulator A bit 15 position. */

/* CTEMS.MSACCAH  bit masks and bit positions */
/* CTEMS_MSACCA  is already defined. */

