gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTEMS.MSACCBL  bit masks and bit positions */
#define CTEMS_MSACCB_gm  0xFFFF  /* MS Accumulator B group mask. */
#define CTEMS_MSACCB_gp  0  /* MS Accumulator B group position. */
#define CTEMS_MSACCB0_bm  (1<<0)  /* MS Accumulator B bit 0 mask. */
#define CTEMS_MSACCB0_bp  0  /* MS Accumulator B bit 0 position. */
#define CTEMS_MSACCB1_bm  (1<<1)  /* MS Accumulator B bit 1 mask. */
#define CTEMS_MSACCB1_bp  1  /* MS Accumulator B bit 1 position. */
#define CTEMS_MSACCB2_bm  (1<<2)  /* MS Accumulator B bit 2 mask. */
#define CTEMS_MSACCB2_bp  2  /* MS Accumulator B bit 2 position. */
#define CTEMS_MSACCB3_bm  (1<<3)  /* MS Accumulator B bit 3 mask. */
#define CTEMS_MSACCB3_bp  3  /* MS Accumulator B bit 3 position. */
#define CTEMS_MSACCB4_bm  (1<<4)  /* MS Accumulator B bit 4 mask. */
#define CTEMS_MSACCB4_bp  4  /* MS Accumulator B bit 4 position. */
#define CTEMS_MSACCB5_bm  (1<<5)  /* MS Accumulator B bit 5 mask. */
#define CTEMS_MSACCB5_bp  5  /* MS Accumulator B bit 5 position. */
#define CTEMS_MSACCB6_bm  (1<<6)  /* MS Accumulator B bit 6 mask. */
#define CTEMS_MSACCB6_bp  6  /* MS Accumulator B bit 6 position. */
#define CTEMS_MSACCB7_bm  (1<<7)  /* MS Accumulator B bit 7 mask. */
#define CTEMS_MSACCB7_bp  7  /* MS Accumulator B bit 7 position. */
#define CTEMS_MSACCB8_bm  (1<<8)  /* MS Accumulator B bit 8 mask. */
#define CTEMS_MSACCB8_bp  8  /* MS Accumulator B bit 8 position. */
#define CTEMS_MSACCB9_bm  (1<<9)  /* MS Accumulator B bit 9 mask. */
#define CTEMS_MSACCB9_bp  9  /* MS Accumulator B bit 9 position. */
#define CTEMS_MSACCB10_bm  (1<<10)  /* MS Accumulator B bit 10 mask. */
#define CTEMS_MSACCB10_bp  10  /* MS Accumulator B bit 10 position. */
#define CTEMS_MSACCB11_bm  (1<<11)  /* MS Accumulator B bit 11 mask. */
#define CTEMS_MSACCB11_bp  11  /* MS Accumulator B bit 11 position. */
#define CTEMS_MSACCB12_bm  (1<<12)  /* MS Accumulator B bit 12 mask. */
#define CTEMS_MSACCB12_bp  12  /* MS Accumulator B bit 12 position. */
#define CTEMS_MSACCB13_bm  (1<<13)  /* MS Accumulator B bit 13 mask. */
#define CTEMS_MSACCB13_bp  13  /* MS Accumulator B bit 13 position. */
#define CTEMS_MSACCB14_bm  (1<<14)  /* MS Accumulator B bit 14 mask. */
#define CTEMS_MSACCB14_bp  14  /* MS Accumulator B bit 14 position. */
#define CTEMS_MSACCB15_bm  (1<<15)  /* MS Accumulator B bit 15 mask. */
#define CTEMS_MSACCB15_bp  15  /* MS Accumulator B bit 15 position. */

/* CTEMS.MSACCBH  bit masks and bit positions */
/* CTEMS_MSACCB  is already defined. */

/* CTEMS.MSACCCNTA  bit masks and bit positions */
#define CTEMS_MSACCCNT_gm  0xFFFF  /* MS Accumulator Counter group mask. */
#define CTEMS_MSACCCNT_gp  0  /* MS Accumulator Counter group position. */
#define CTEMS_MSACCCNT0_bm  (1<<0)  /* MS Accumulator Counter bit 0 mask. */
#define CTEMS_MSACCCNT0_bp  0  /* MS Accumulator Counter bit 0 position. */
#define CTEMS_MSACCCNT1_bm  (1<<1)  /* MS Accumulator Counter bit 1 mask. */
#define CTEMS_MSACCCNT1_bp  1  /* MS Accumulator Counter bit 1 position. */
#define CTEMS_MSACCCNT2_bm  (1<<2)  /* MS Accumulator Counter bit 2 mask. */
#define CTEMS_MSACCCNT2_bp  2  /* MS Accumulator Counter bit 2 position. */
#define CTEMS_MSACCCNT3_bm  (1<<3)  /* MS Accumulator Counter bit 3 mask. */
#define CTEMS_MSACCCNT3_bp  3  /* MS Accumulator Counter bit 3 position. */
#define CTEMS_MSACCCNT4_bm  (1<<4)  /* MS Accumulator Counter bit 4 mask. */
#define CTEMS_MSACCCNT4_bp  4  /* MS Accumulator Counter bit 4 position. */
#define CTEMS_MSACCCNT5_bm  (1<<5)  /* MS Accumulator Counter bit 5 mask. */
#define CTEMS_MSACCCNT5_bp  5  /* MS Accumulator Counter bit 5 position. */
#define CTEMS_MSACCCNT6_bm  (1<<6)  /* MS Accumulator Counter bit 6 mask. */
#define CTEMS_MSACCCNT6_bp  6  /* MS Accumulator Counter bit 6 position. */
#define CTEMS_MSACCCNT7_bm  (1<<7)  /* MS Accumulator Counter bit 7 mask. */
#define CTEMS_MSACCCNT7_bp  7  /* MS Accumulator Counter bit 7 position. */
#define CTEMS_MSACCCNT8_bm  (1<<8)  /* MS Accumulator Counter bit 8 mask. */
#define CTEMS_MSACCCNT8_bp  8  /* MS Accumulator Counter bit 8 position. */
#define CTEMS_MSACCCNT9_bm  (1<<9)  /* MS Accumulator Counter bit 9 mask. */
#define CTEMS_MSACCCNT9_bp  9  /* MS Accumulator Counter bit 9 position. */
#define CTEMS_MSACCCNT10_bm  (1<<10)  /* MS Accumulator Counter bit 10 mask. */
#define CTEMS_MSACCCNT10_bp  10  /* MS Accumulator Counter bit 10 position. */
#define CTEMS_MSACCCNT11_bm  (1<<11)  /* MS Accumulator Counter bit 11 mask. */
#define CTEMS_MSACCCNT11_bp  11  /* MS Accumulator Counter bit 11 position. */
#define CTEMS_MSACCCNT12_bm  (1<<12)  /* MS Accumulator Counter bit 12 mask. */
#define CTEMS_MSACCCNT12_bp  12  /* MS Accumulator Counter bit 12 position. */
#define CTEMS_MSACCCNT13_bm  (1<<13)  /* MS Accumulator Counter bit 13 mask. */
#define CTEMS_MSACCCNT13_bp  13  /* MS Accumulator Counter bit 13 position. */
#define CTEMS_MSACCCNT14_bm  (1<<14)  /* MS Accumulator Counter bit 14 mask. */
#define CTEMS_MSACCCNT14_bp  14  /* MS Accumulator Counter bit 14 position. */
#define CTEMS_MSACCCNT15_bm  (1<<15)  /* MS Accumulator Counter bit 15 mask. */
#define CTEMS_MSACCCNT15_bp  15  /* MS Accumulator Counter bit 15 position. */

/* CTEMS.MSACCCNTB  bit masks and bit positions */
/* CTEMS_MSACCCNT  is already defined. */

/* CTEMS.MSMAXA  bit masks and bit positions */
#define CTEMS_MSMAX_gm  0xFFFF  /* MS Max group mask. */
#define CTEMS_MSMAX_gp  0  /* MS Max group position. */
#define CTEMS_MSMAX0_bm  (1<<0)  /* MS Max bit 0 mask. */
#define CTEMS_MSMAX0_bp  0  /* MS Max bit 0 position. */
#define CTEMS_MSMAX1_bm  (1<<1)  /* MS Max bit 1 mask. */
#define CTEMS_MSMAX1_bp  1  /* MS Max bit 1 position. */
#define CTEMS_MSMAX2_bm  (1<<2)  /* MS Max bit 2 mask. */
#define CTEMS_MSMAX2_bp  2  /* MS Max bit 2 position. */
#define CTEMS_MSMAX3_bm  (1<<3)  /* MS Max bit 3 mask. */
#define CTEMS_MSMAX3_bp  3  /* MS Max bit 3 position. */
#define CTEMS_MSMAX4_bm  (1<<4)  /* MS Max bit 4 mask. */
#define CTEMS_MSMAX4_bp  4  /* MS Max bit 4 position. */
#define CTEMS_MSMAX5_bm  (1<<5)  /* MS Max bit 5 mask. */
#define CTEMS_MSMAX5_bp  5  /* MS Max bit 5 position. */
#define CTEMS_MSMAX6_bm  (1<<6)  /* MS Max bit 6 mask. */
#define CTEMS_MSMAX6_bp  6  /* MS Max bit 6 position. */
#define CTEMS_MSMAX7_bm  (1<<7)  /* MS Max bit 7 mask. */
#define CTEMS_MSMAX7_bp  7  /* MS Max bit 7 position. */
#define CTEMS_MSMAX8_bm  (1<<8)  /* MS Max bit 8 mask. */
#define CTEMS_MSMAX8_bp  8  /* MS Max bit 8 position. */
#define CTEMS_MSMAX9_bm  (1<<9)  /* MS Max bit 9 mask. */
#define CTEMS_MSMAX9_bp  9  /* MS Max bit 9 position. */
#define CTEMS_MSMAX10_bm  (1<<10)  /* MS Max bit 10 mask. */
#define CTEMS_MSMAX10_bp  10  /* MS Max bit 10 position. */
#define CTEMS_MSMAX11_bm  (1<<11)  /* MS Max bit 11 mask. */
#define CTEMS_MSMAX11_bp  11  /* MS Max bit 11 position. */
#define CTEMS_MSMAX12_bm  (1<<12)  /* MS Max bit 12 mask. */
#define CTEMS_MSMAX12_bp  12  /* MS Max bit 12 position. */
#define CTEMS_MSMAX13_bm  (1<<13)  /* MS Max bit 13 mask. */
#define CTEMS_MSMAX13_bp  13  /* MS Max bit 13 position. */
#define CTEMS_MSMAX14_bm  (1<<14)  /* MS Max bit 14 mask. */
#define CTEMS_MSMAX14_bp  14  /* MS Max bit 14 position. */
#define CTEMS_MSMAX15_bm  (1<<15)  /* MS Max bit 15 mask. */
#define CTEMS_MSMAX15_bp  15  /* MS Max bit 15 position. */

/* CTEMS.MSMAXB  bit masks and bit positions */
/* CTEMS_MSMAX  is already defined. */

/* CTEMS.MSMINA  bit masks and bit positions */
#define CTEMS_MSMIN_gm  0xFFFF  /* MS Min group mask. */
#define CTEMS_MSMIN_gp  0  /* MS Min group position. */
#define CTEMS_MSMIN0_bm  (1<<0)  /* MS Min bit 0 mask. */
#define CTEMS_MSMIN0_bp  0  /* MS Min bit 0 position. */
#define CTEMS_MSMIN1_bm  (1<<1)  /* MS Min bit 1 mask. */
#define CTEMS_MSMIN1_bp  1  /* MS Min bit 1 position. */
#define CTEMS_MSMIN2_bm  (1<<2)  /* MS Min bit 2 mask. */
#define CTEMS_MSMIN2_bp  2  /* MS Min bit 2 position. */
#define CTEMS_MSMIN3_bm  (1<<3)  /* MS Min bit 3 mask. */
#define CTEMS_MSMIN3_bp  3  /* MS Min bit 3 position. */
#define CTEMS_MSMIN4_bm  (1<<4)  /* MS Min bit 4 mask. */
#define CTEMS_MSMIN4_bp  4  /* MS Min bit 4 position. */
#define CTEMS_MSMIN5_bm  (1<<5)  /* MS Min bit 5 mask. */
#define CTEMS_MSMIN5_bp  5  /* MS Min bit 5 position. */
#define CTEMS_MSMIN6_bm  (1<<6)  /* MS Min bit 6 mask. */
#define CTEMS_MSMIN6_bp  6  /* MS Min bit 6 position. */
#define CTEMS_MSMIN7_bm  (1<<7)  /* MS Min bit 7 mask. */
#define CTEMS_MSMIN7_bp  7  /* MS Min bit 7 position. */
#define CTEMS_MSMIN8_bm  (1<<8)  /* MS Min bit 8 mask. */
#define CTEMS_MSMIN8_bp  8  /* MS Min bit 8 position. */
#define CTEMS_MSMIN9_bm  (1<<9)  /* MS Min bit 9 mask. */
#define CTEMS_MSMIN9_bp  9  /* MS Min bit 9 position. */
#define CTEMS_MSMIN10_bm  (1<<10)  /* MS Min bit 10 mask. */
#define CTEMS_MSMIN10_bp  10  /* MS Min bit 10 position. */
#define CTEMS_MSMIN11_bm  (1<<11)  /* MS Min bit 11 mask. */
#define CTEMS_MSMIN11_bp  11  /* MS Min bit 11 position. */
#define CTEMS_MSMIN12_bm  (1<<12)  /* MS Min bit 12 mask. */
#define CTEMS_MSMIN12_bp  12  /* MS Min bit 12 position. */
#define CTEMS_MSMIN13_bm  (1<<13)  /* MS Min bit 13 mask. */
#define CTEMS_MSMIN13_bp  13  /* MS Min bit 13 position. */
#define CTEMS_MSMIN14_bm  (1<<14)  /* MS Min bit 14 mask. */
#define CTEMS_MSMIN14_bp  14  /* MS Min bit 14 position. */
#define CTEMS_MSMIN15_bm  (1<<15)  /* MS Min bit 15 mask. */
#define CTEMS_MSMIN15_bp  15  /* MS Min bit 15 position. */

