gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTEMS.MSSRD  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_GCAFCCCWL_bm  0x20  /* GCAF Computation Complete Counter Within Limit bit mask. */
#define CTEMS_GCAFCCCWL_bp  5  /* GCAF Computation Complete Counter Within Limit bit position. */
#define CTEMS_GCAFIDLE_bm  0x40  /* GCAF Idle bit mask. */
#define CTEMS_GCAFIDLE_bp  6  /* GCAF Idle bit position. */

/* CTEMS.MSSRE  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_MSHDLCLR_bm  0x02  /* Any Headroom Detector Low output is cleared bit mask. */
#define CTEMS_MSHDLCLR_bp  1  /* Any Headroom Detector Low output is cleared bit position. */
#define CTEMS_MSHDLSET_bm  0x04  /* Any Headroom Detector Low output is set bit mask. */
#define CTEMS_MSHDLSET_bp  2  /* Any Headroom Detector Low output is set bit position. */
#define CTEMS_MSHDHCLR_bm  0x08  /* Any Headroom Detector High output is cleared bit mask. */
#define CTEMS_MSHDHCLR_bp  3  /* Any Headroom Detector High output is cleared bit position. */
#define CTEMS_MSHDHSET_bm  0x10  /* Any Headroom Detector High output is set bit mask. */
#define CTEMS_MSHDHSET_bp  4  /* Any Headroom Detector High output is set bit position. */

/* CTEMS.MSCCR  bit masks and bit positions */
#define CTEMS_CW_bm  0x01  /* Carry Word bit mask. */
#define CTEMS_CW_bp  0  /* Carry Word bit position. */
#define CTEMS_SW_bm  0x02  /* Signed Word bit mask. */
#define CTEMS_SW_bp  1  /* Signed Word bit position. */
#define CTEMS_PW_bm  0x04  /* Positive Word bit mask. */
#define CTEMS_PW_bp  2  /* Positive Word bit position. */
#define CTEMS_ZW_bm  0x08  /* Zero Word bit mask. */
#define CTEMS_ZW_bp  3  /* Zero Word bit position. */
#define CTEMS_T_gm  0xF0  /* T[3:0] temp flags group mask. */
#define CTEMS_T_gp  4  /* T[3:0] temp flags group position. */
#define CTEMS_T0_bm  (1<<4)  /* T[3:0] temp flags bit 0 mask. */
#define CTEMS_T0_bp  4  /* T[3:0] temp flags bit 0 position. */
#define CTEMS_T1_bm  (1<<5)  /* T[3:0] temp flags bit 1 mask. */
#define CTEMS_T1_bp  5  /* T[3:0] temp flags bit 1 position. */
#define CTEMS_T2_bm  (1<<6)  /* T[3:0] temp flags bit 2 mask. */
#define CTEMS_T2_bp  6  /* T[3:0] temp flags bit 2 position. */
#define CTEMS_T3_bm  (1<<7)  /* T[3:0] temp flags bit 3 mask. */
#define CTEMS_T3_bp  7  /* T[3:0] temp flags bit 3 position. */

/* CTEMS.MSLINK  bit masks and bit positions */
#define CTEMS_MSLINK_gm  0x1FFF  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) group mask. */
#define CTEMS_MSLINK_gp  0  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) group position. */
#define CTEMS_MSLINK0_bm  (1<<0)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 0 mask. */
#define CTEMS_MSLINK0_bp  0  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 0 position. */
#define CTEMS_MSLINK1_bm  (1<<1)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 1 mask. */
#define CTEMS_MSLINK1_bp  1  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 1 position. */
#define CTEMS_MSLINK2_bm  (1<<2)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 2 mask. */
#define CTEMS_MSLINK2_bp  2  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 2 position. */
#define CTEMS_MSLINK3_bm  (1<<3)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 3 mask. */
#define CTEMS_MSLINK3_bp  3  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 3 position. */
#define CTEMS_MSLINK4_bm  (1<<4)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 4 mask. */
#define CTEMS_MSLINK4_bp  4  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 4 position. */
#define CTEMS_MSLINK5_bm  (1<<5)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 5 mask. */
#define CTEMS_MSLINK5_bp  5  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 5 position. */
#define CTEMS_MSLINK6_bm  (1<<6)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 6 mask. */
#define CTEMS_MSLINK6_bp  6  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 6 position. */
#define CTEMS_MSLINK7_bm  (1<<7)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 7 mask. */
#define CTEMS_MSLINK7_bp  7  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 7 position. */
#define CTEMS_MSLINK8_bm  (1<<8)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 8 mask. */
#define CTEMS_MSLINK8_bp  8  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 8 position. */
#define CTEMS_MSLINK9_bm  (1<<9)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 9 mask. */
#define CTEMS_MSLINK9_bp  9  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 9 position. */
#define CTEMS_MSLINK10_bm  (1<<10)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 10 mask. */
#define CTEMS_MSLINK10_bp  10  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 10 position. */
#define CTEMS_MSLINK11_bm  (1<<11)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 11 mask. */
#define CTEMS_MSLINK11_bp  11  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 11 position. */
#define CTEMS_MSLINK12_bm  (1<<12)  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 12 mask. */
#define CTEMS_MSLINK12_bp  12  /* uS 1 has 13 bit, and uS 0 has 12 bit (bit 12 is unused) bit 12 position. */

/* CTE.ADCYCHR  bit masks and bit positions */
#define CTE_ADCYCH_gm  0x1F  /* ADC Y-Channel group mask. */
#define CTE_ADCYCH_gp  0  /* ADC Y-Channel group position. */
#define CTE_ADCYCH0_bm  (1<<0)  /* ADC Y-Channel bit 0 mask. */
#define CTE_ADCYCH0_bp  0  /* ADC Y-Channel bit 0 position. */
#define CTE_ADCYCH1_bm  (1<<1)  /* ADC Y-Channel bit 1 mask. */
#define CTE_ADCYCH1_bp  1  /* ADC Y-Channel bit 1 position. */
#define CTE_ADCYCH2_bm  (1<<2)  /* ADC Y-Channel bit 2 mask. */
#define CTE_ADCYCH2_bp  2  /* ADC Y-Channel bit 2 position. */
#define CTE_ADCYCH3_bm  (1<<3)  /* ADC Y-Channel bit 3 mask. */
#define CTE_ADCYCH3_bp  3  /* ADC Y-Channel bit 3 position. */
#define CTE_ADCYCH4_bm  (1<<4)  /* ADC Y-Channel bit 4 mask. */
#define CTE_ADCYCH4_bp  4  /* ADC Y-Channel bit 4 position. */
#define CTE_ADCSC_bm  0x20  /* ADC Single Conversion bit mask. */
#define CTE_ADCSC_bp  5  /* ADC Single Conversion bit position. */
#define CTE_ADCAUX_bm  0x40  /* ADC Auxillary Channel Enable bit mask. */
#define CTE_ADCAUX_bp  6  /* ADC Auxillary Channel Enable bit position. */

/* CTE.INTCRC  bit masks and bit positions */
#define CTE_INTRSTLVL_gm  0xFF  /* Integrator Reset Level group mask. */
#define CTE_INTRSTLVL_gp  0  /* Integrator Reset Level group position. */
#define CTE_INTRSTLVL0_bm  (1<<0)  /* Integrator Reset Level bit 0 mask. */
#define CTE_INTRSTLVL0_bp  0  /* Integrator Reset Level bit 0 position. */
#define CTE_INTRSTLVL1_bm  (1<<1)  /* Integrator Reset Level bit 1 mask. */
#define CTE_INTRSTLVL1_bp  1  /* Integrator Reset Level bit 1 position. */
#define CTE_INTRSTLVL2_bm  (1<<2)  /* Integrator Reset Level bit 2 mask. */
#define CTE_INTRSTLVL2_bp  2  /* Integrator Reset Level bit 2 position. */
#define CTE_INTRSTLVL3_bm  (1<<3)  /* Integrator Reset Level bit 3 mask. */
#define CTE_INTRSTLVL3_bp  3  /* Integrator Reset Level bit 3 position. */
#define CTE_INTRSTLVL4_bm  (1<<4)  /* Integrator Reset Level bit 4 mask. */
#define CTE_INTRSTLVL4_bp  4  /* Integrator Reset Level bit 4 position. */
#define CTE_INTRSTLVL5_bm  (1<<5)  /* Integrator Reset Level bit 5 mask. */
#define CTE_INTRSTLVL5_bp  5  /* Integrator Reset Level bit 5 position. */
#define CTE_INTRSTLVL6_bm  (1<<6)  /* Integrator Reset Level bit 6 mask. */
#define CTE_INTRSTLVL6_bp  6  /* Integrator Reset Level bit 6 position. */
#define CTE_INTRSTLVL7_bm  (1<<7)  /* Integrator Reset Level bit 7 mask. */
#define CTE_INTRSTLVL7_bp  7  /* Integrator Reset Level bit 7 position. */

/* CTE.ADCSRACLR  bit masks and bit positions */
#define CTE_ADCLC_bm  0x01  /* ADC Last Conversion bit mask. */
#define CTE_ADCLC_bp  0  /* ADC Last Conversion bit position. */
#define CTE_ADCLCX_bm  0x02  /* ADC Last Conversion in X-Line bit mask. */
#define CTE_ADCLCX_bp  1  /* ADC Last Conversion in X-Line bit position. */
#define CTE_ADCVC_bm  0x04  /* ADC Valid Conversion bit mask. */
#define CTE_ADCVC_bp  2  /* ADC Valid Conversion bit position. */
#define CTE_ADCPS_bm  0x08  /* ADC Power Save bit mask. */
#define CTE_ADCPS_bp  3  /* ADC Power Save bit position. */
#define CTE_ADCBUSY_bm  0x10  /* First Stage of ADC Sampling Valid Data bit mask. */
#define CTE_ADCBUSY_bp  4  /* First Stage of ADC Sampling Valid Data bit position. */
#define CTE_ADCPIPEBUSY_bm  0x20  /* Valid Data in ADC Pipeline Register bit mask. */
#define CTE_ADCPIPEBUSY_bp  5  /* Valid Data in ADC Pipeline Register bit position. */
#define CTE_ADCANAPIPEBUSY_bm  0x40  /* Valid Samples in Analog Pipeline bit mask. */
#define CTE_ADCANAPIPEBUSY_bp  6  /* Valid Samples in Analog Pipeline bit position. */

/* CTE.ADCSRASET  bit masks and bit positions */
/* CTE_ADCLC  is already defined. */
/* CTE_ADCLCX  is already defined. */
/* CTE_ADCVC  is already defined. */
/* CTE_ADCPS  is already defined. */
/* CTE_ADCBUSY  is already defined. */
/* CTE_ADCPIPEBUSY  is already defined. */
/* CTE_ADCANAPIPEBUSY  is already defined. */

/* CTE.INTCRBCLR  bit masks and bit positions */
#define CTE_INTSIGN_bm  0x01  /* Integrator Sign bit mask. */
#define CTE_INTSIGN_bp  0  /* Integrator Sign bit position. */
#define CTE_TIMA_bm  0x02  /* Timer A bit mask. */
#define CTE_TIMA_bp  1  /* Timer A bit position. */
#define CTE_TIMB_bm  0x04  /* Timer B bit mask. */
#define CTE_TIMB_bp  2  /* Timer B bit position. */
#define CTE_TIMC_bm  0x08  /* Timer C bit mask. */
#define CTE_TIMC_bp  3  /* Timer C bit position. */
#define CTE_INTMOE_bm  0x10  /* Integrator Master Output Enable bit mask. */
#define CTE_INTMOE_bp  4  /* Integrator Master Output Enable bit position. */
#define CTE_INTRST_bm  0x20  /* Integrator Reset bit mask. */
#define CTE_INTRST_bp  5  /* Integrator Reset bit position. */
#define CTE_INTDBULKPWR_bm  0x40  /* Connects bulk dummy to Avdd bit mask. */
#define CTE_INTDBULKPWR_bp  6  /* Connects bulk dummy to Avdd bit position. */
#define CTE_INTID_bm  0x80  /* Integrator Input Disable bit mask. */
#define CTE_INTID_bp  7  /* Integrator Input Disable bit position. */
#define CTE_INTAUTOCAL_gm  0x300  /* Integrator Automatic Calibration group mask. */
#define CTE_INTAUTOCAL_gp  8  /* Integrator Automatic Calibration group position. */
#define CTE_INTAUTOCAL0_bm  (1<<8)  /* Integrator Automatic Calibration bit 0 mask. */
#define CTE_INTAUTOCAL0_bp  8  /* Integrator Automatic Calibration bit 0 position. */
#define CTE_INTAUTOCAL1_bm  (1<<9)  /* Integrator Automatic Calibration bit 1 mask. */
#define CTE_INTAUTOCAL1_bp  9  /* Integrator Automatic Calibration bit 1 position. */
#define CTE_INTIBUFD_bm  0x400  /* Integrator Input Buffer Disable bit mask. */
#define CTE_INTIBUFD_bp  10  /* Integrator Input Buffer Disable bit position. */
#define CTE_INTIAMPOD_bm  0x800  /* Integrator Current Amplifier Output Disable bit mask. */
#define CTE_INTIAMPOD_bp  11  /* Integrator Current Amplifier Output Disable bit position. */
#define CTE_INTIBULKPWR_bm  0x1000  /* Connects bulk of input sw to Avdd bit mask. */
#define CTE_INTIBULKPWR_bp  12  /* Connects bulk of input sw to Avdd bit position. */
#define CTE_INTDIBUFD_bm  0x2000  /* Integrator Dummy Input Buffer Disable bit mask. */
#define CTE_INTDIBUFD_bp  13  /* Integrator Dummy Input Buffer Disable bit position. */

