gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.TIMMOECMP  bit masks and bit positions */
#define CTE_TIMMOECMP_gm  0x3FF  /* Timer Master Output Enable Compare group mask. */
#define CTE_TIMMOECMP_gp  0  /* Timer Master Output Enable Compare group position. */
#define CTE_TIMMOECMP0_bm  (1<<0)  /* Timer Master Output Enable Compare bit 0 mask. */
#define CTE_TIMMOECMP0_bp  0  /* Timer Master Output Enable Compare bit 0 position. */
#define CTE_TIMMOECMP1_bm  (1<<1)  /* Timer Master Output Enable Compare bit 1 mask. */
#define CTE_TIMMOECMP1_bp  1  /* Timer Master Output Enable Compare bit 1 position. */
#define CTE_TIMMOECMP2_bm  (1<<2)  /* Timer Master Output Enable Compare bit 2 mask. */
#define CTE_TIMMOECMP2_bp  2  /* Timer Master Output Enable Compare bit 2 position. */
#define CTE_TIMMOECMP3_bm  (1<<3)  /* Timer Master Output Enable Compare bit 3 mask. */
#define CTE_TIMMOECMP3_bp  3  /* Timer Master Output Enable Compare bit 3 position. */
#define CTE_TIMMOECMP4_bm  (1<<4)  /* Timer Master Output Enable Compare bit 4 mask. */
#define CTE_TIMMOECMP4_bp  4  /* Timer Master Output Enable Compare bit 4 position. */
#define CTE_TIMMOECMP5_bm  (1<<5)  /* Timer Master Output Enable Compare bit 5 mask. */
#define CTE_TIMMOECMP5_bp  5  /* Timer Master Output Enable Compare bit 5 position. */
#define CTE_TIMMOECMP6_bm  (1<<6)  /* Timer Master Output Enable Compare bit 6 mask. */
#define CTE_TIMMOECMP6_bp  6  /* Timer Master Output Enable Compare bit 6 position. */
#define CTE_TIMMOECMP7_bm  (1<<7)  /* Timer Master Output Enable Compare bit 7 mask. */
#define CTE_TIMMOECMP7_bp  7  /* Timer Master Output Enable Compare bit 7 position. */
#define CTE_TIMMOECMP8_bm  (1<<8)  /* Timer Master Output Enable Compare bit 8 mask. */
#define CTE_TIMMOECMP8_bp  8  /* Timer Master Output Enable Compare bit 8 position. */
#define CTE_TIMMOECMP9_bm  (1<<9)  /* Timer Master Output Enable Compare bit 9 mask. */
#define CTE_TIMMOECMP9_bp  9  /* Timer Master Output Enable Compare bit 9 position. */

/* CTE.HVCRA  bit masks and bit positions */
#define CTE_HVPEN_bm  0x01  /* High Voltage Pump Enable bit mask. */
#define CTE_HVPEN_bp  0  /* High Voltage Pump Enable bit position. */
#define CTE_HVSWEN_bm  0x02  /* High Voltage Switch Enable bit mask. */
#define CTE_HVSWEN_bp  1  /* High Voltage Switch Enable bit position. */
#define CTE_HVSEQEN_bm  0x04  /* High Voltage Sequencer Enable bit mask. */
#define CTE_HVSEQEN_bp  2  /* High Voltage Sequencer Enable bit position. */

/* CTE.TIMAPER  bit masks and bit positions */
#define CTE_TIMAPER_gm  0x3FF  /* Timer A Period group mask. */
#define CTE_TIMAPER_gp  0  /* Timer A Period group position. */
#define CTE_TIMAPER0_bm  (1<<0)  /* Timer A Period bit 0 mask. */
#define CTE_TIMAPER0_bp  0  /* Timer A Period bit 0 position. */
#define CTE_TIMAPER1_bm  (1<<1)  /* Timer A Period bit 1 mask. */
#define CTE_TIMAPER1_bp  1  /* Timer A Period bit 1 position. */
#define CTE_TIMAPER2_bm  (1<<2)  /* Timer A Period bit 2 mask. */
#define CTE_TIMAPER2_bp  2  /* Timer A Period bit 2 position. */
#define CTE_TIMAPER3_bm  (1<<3)  /* Timer A Period bit 3 mask. */
#define CTE_TIMAPER3_bp  3  /* Timer A Period bit 3 position. */
#define CTE_TIMAPER4_bm  (1<<4)  /* Timer A Period bit 4 mask. */
#define CTE_TIMAPER4_bp  4  /* Timer A Period bit 4 position. */
#define CTE_TIMAPER5_bm  (1<<5)  /* Timer A Period bit 5 mask. */
#define CTE_TIMAPER5_bp  5  /* Timer A Period bit 5 position. */
#define CTE_TIMAPER6_bm  (1<<6)  /* Timer A Period bit 6 mask. */
#define CTE_TIMAPER6_bp  6  /* Timer A Period bit 6 position. */
#define CTE_TIMAPER7_bm  (1<<7)  /* Timer A Period bit 7 mask. */
#define CTE_TIMAPER7_bp  7  /* Timer A Period bit 7 position. */
#define CTE_TIMAPER8_bm  (1<<8)  /* Timer A Period bit 8 mask. */
#define CTE_TIMAPER8_bp  8  /* Timer A Period bit 8 position. */
#define CTE_TIMAPER9_bm  (1<<9)  /* Timer A Period bit 9 mask. */
#define CTE_TIMAPER9_bp  9  /* Timer A Period bit 9 position. */

/* CTE.TIMBPER  bit masks and bit positions */
#define CTE_TIMBPER_gm  0x3FF  /* Timer B Period group mask. */
#define CTE_TIMBPER_gp  0  /* Timer B Period group position. */
#define CTE_TIMBPER0_bm  (1<<0)  /* Timer B Period bit 0 mask. */
#define CTE_TIMBPER0_bp  0  /* Timer B Period bit 0 position. */
#define CTE_TIMBPER1_bm  (1<<1)  /* Timer B Period bit 1 mask. */
#define CTE_TIMBPER1_bp  1  /* Timer B Period bit 1 position. */
#define CTE_TIMBPER2_bm  (1<<2)  /* Timer B Period bit 2 mask. */
#define CTE_TIMBPER2_bp  2  /* Timer B Period bit 2 position. */
#define CTE_TIMBPER3_bm  (1<<3)  /* Timer B Period bit 3 mask. */
#define CTE_TIMBPER3_bp  3  /* Timer B Period bit 3 position. */
#define CTE_TIMBPER4_bm  (1<<4)  /* Timer B Period bit 4 mask. */
#define CTE_TIMBPER4_bp  4  /* Timer B Period bit 4 position. */
#define CTE_TIMBPER5_bm  (1<<5)  /* Timer B Period bit 5 mask. */
#define CTE_TIMBPER5_bp  5  /* Timer B Period bit 5 position. */
#define CTE_TIMBPER6_bm  (1<<6)  /* Timer B Period bit 6 mask. */
#define CTE_TIMBPER6_bp  6  /* Timer B Period bit 6 position. */
#define CTE_TIMBPER7_bm  (1<<7)  /* Timer B Period bit 7 mask. */
#define CTE_TIMBPER7_bp  7  /* Timer B Period bit 7 position. */
#define CTE_TIMBPER8_bm  (1<<8)  /* Timer B Period bit 8 mask. */
#define CTE_TIMBPER8_bp  8  /* Timer B Period bit 8 position. */
#define CTE_TIMBPER9_bm  (1<<9)  /* Timer B Period bit 9 mask. */
#define CTE_TIMBPER9_bp  9  /* Timer B Period bit 9 position. */

/* CTE.TIMCPER  bit masks and bit positions */
#define CTE_TIMCPER_gm  0x3FF  /* Timer C Period group mask. */
#define CTE_TIMCPER_gp  0  /* Timer C Period group position. */
#define CTE_TIMCPER0_bm  (1<<0)  /* Timer C Period bit 0 mask. */
#define CTE_TIMCPER0_bp  0  /* Timer C Period bit 0 position. */
#define CTE_TIMCPER1_bm  (1<<1)  /* Timer C Period bit 1 mask. */
#define CTE_TIMCPER1_bp  1  /* Timer C Period bit 1 position. */
#define CTE_TIMCPER2_bm  (1<<2)  /* Timer C Period bit 2 mask. */
#define CTE_TIMCPER2_bp  2  /* Timer C Period bit 2 position. */
#define CTE_TIMCPER3_bm  (1<<3)  /* Timer C Period bit 3 mask. */
#define CTE_TIMCPER3_bp  3  /* Timer C Period bit 3 position. */
#define CTE_TIMCPER4_bm  (1<<4)  /* Timer C Period bit 4 mask. */
#define CTE_TIMCPER4_bp  4  /* Timer C Period bit 4 position. */
#define CTE_TIMCPER5_bm  (1<<5)  /* Timer C Period bit 5 mask. */
#define CTE_TIMCPER5_bp  5  /* Timer C Period bit 5 position. */
#define CTE_TIMCPER6_bm  (1<<6)  /* Timer C Period bit 6 mask. */
#define CTE_TIMCPER6_bp  6  /* Timer C Period bit 6 position. */
#define CTE_TIMCPER7_bm  (1<<7)  /* Timer C Period bit 7 mask. */
#define CTE_TIMCPER7_bp  7  /* Timer C Period bit 7 position. */
#define CTE_TIMCPER8_bm  (1<<8)  /* Timer C Period bit 8 mask. */
#define CTE_TIMCPER8_bp  8  /* Timer C Period bit 8 position. */
#define CTE_TIMCPER9_bm  (1<<9)  /* Timer C Period bit 9 mask. */
#define CTE_TIMCPER9_bp  9  /* Timer C Period bit 9 position. */

/* CTE.TIMMOEPER  bit masks and bit positions */
#define CTE_TIMMOEPER_gm  0x3FF  /* Timer Master Output Enable Period group mask. */
#define CTE_TIMMOEPER_gp  0  /* Timer Master Output Enable Period group position. */
#define CTE_TIMMOEPER0_bm  (1<<0)  /* Timer Master Output Enable Period bit 0 mask. */
#define CTE_TIMMOEPER0_bp  0  /* Timer Master Output Enable Period bit 0 position. */
#define CTE_TIMMOEPER1_bm  (1<<1)  /* Timer Master Output Enable Period bit 1 mask. */
#define CTE_TIMMOEPER1_bp  1  /* Timer Master Output Enable Period bit 1 position. */
#define CTE_TIMMOEPER2_bm  (1<<2)  /* Timer Master Output Enable Period bit 2 mask. */
#define CTE_TIMMOEPER2_bp  2  /* Timer Master Output Enable Period bit 2 position. */
#define CTE_TIMMOEPER3_bm  (1<<3)  /* Timer Master Output Enable Period bit 3 mask. */
#define CTE_TIMMOEPER3_bp  3  /* Timer Master Output Enable Period bit 3 position. */
#define CTE_TIMMOEPER4_bm  (1<<4)  /* Timer Master Output Enable Period bit 4 mask. */
#define CTE_TIMMOEPER4_bp  4  /* Timer Master Output Enable Period bit 4 position. */
#define CTE_TIMMOEPER5_bm  (1<<5)  /* Timer Master Output Enable Period bit 5 mask. */
#define CTE_TIMMOEPER5_bp  5  /* Timer Master Output Enable Period bit 5 position. */
#define CTE_TIMMOEPER6_bm  (1<<6)  /* Timer Master Output Enable Period bit 6 mask. */
#define CTE_TIMMOEPER6_bp  6  /* Timer Master Output Enable Period bit 6 position. */
#define CTE_TIMMOEPER7_bm  (1<<7)  /* Timer Master Output Enable Period bit 7 mask. */
#define CTE_TIMMOEPER7_bp  7  /* Timer Master Output Enable Period bit 7 position. */
#define CTE_TIMMOEPER8_bm  (1<<8)  /* Timer Master Output Enable Period bit 8 mask. */
#define CTE_TIMMOEPER8_bp  8  /* Timer Master Output Enable Period bit 8 position. */
#define CTE_TIMMOEPER9_bm  (1<<9)  /* Timer Master Output Enable Period bit 9 mask. */
#define CTE_TIMMOEPER9_bp  9  /* Timer Master Output Enable Period bit 9 position. */

/* CTE.TIMRSTPER  bit masks and bit positions */
#define CTE_TIMRSTPER_gm  0x3FF  /* Timer Reset Enable Period group mask. */
#define CTE_TIMRSTPER_gp  0  /* Timer Reset Enable Period group position. */
#define CTE_TIMRSTPER0_bm  (1<<0)  /* Timer Reset Enable Period bit 0 mask. */
#define CTE_TIMRSTPER0_bp  0  /* Timer Reset Enable Period bit 0 position. */
#define CTE_TIMRSTPER1_bm  (1<<1)  /* Timer Reset Enable Period bit 1 mask. */
#define CTE_TIMRSTPER1_bp  1  /* Timer Reset Enable Period bit 1 position. */
#define CTE_TIMRSTPER2_bm  (1<<2)  /* Timer Reset Enable Period bit 2 mask. */
#define CTE_TIMRSTPER2_bp  2  /* Timer Reset Enable Period bit 2 position. */
#define CTE_TIMRSTPER3_bm  (1<<3)  /* Timer Reset Enable Period bit 3 mask. */
#define CTE_TIMRSTPER3_bp  3  /* Timer Reset Enable Period bit 3 position. */
#define CTE_TIMRSTPER4_bm  (1<<4)  /* Timer Reset Enable Period bit 4 mask. */
#define CTE_TIMRSTPER4_bp  4  /* Timer Reset Enable Period bit 4 position. */
#define CTE_TIMRSTPER5_bm  (1<<5)  /* Timer Reset Enable Period bit 5 mask. */
#define CTE_TIMRSTPER5_bp  5  /* Timer Reset Enable Period bit 5 position. */
#define CTE_TIMRSTPER6_bm  (1<<6)  /* Timer Reset Enable Period bit 6 mask. */
#define CTE_TIMRSTPER6_bp  6  /* Timer Reset Enable Period bit 6 position. */
#define CTE_TIMRSTPER7_bm  (1<<7)  /* Timer Reset Enable Period bit 7 mask. */
#define CTE_TIMRSTPER7_bp  7  /* Timer Reset Enable Period bit 7 position. */
#define CTE_TIMRSTPER8_bm  (1<<8)  /* Timer Reset Enable Period bit 8 mask. */
#define CTE_TIMRSTPER8_bp  8  /* Timer Reset Enable Period bit 8 position. */
#define CTE_TIMRSTPER9_bm  (1<<9)  /* Timer Reset Enable Period bit 9 mask. */
#define CTE_TIMRSTPER9_bp  9  /* Timer Reset Enable Period bit 9 position. */

