gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PIFYTGLB  bit masks and bit positions */
/* CTE_PIFYTGL  is already defined. */

/* CTE.PIFILA  bit masks and bit positions */
#define CTE_PIFIL_gm  0xFFFF  /* Interleave register access group mask. */
#define CTE_PIFIL_gp  0  /* Interleave register access group position. */
#define CTE_PIFIL0_bm  (1<<0)  /* Interleave register access bit 0 mask. */
#define CTE_PIFIL0_bp  0  /* Interleave register access bit 0 position. */
#define CTE_PIFIL1_bm  (1<<1)  /* Interleave register access bit 1 mask. */
#define CTE_PIFIL1_bp  1  /* Interleave register access bit 1 position. */
#define CTE_PIFIL2_bm  (1<<2)  /* Interleave register access bit 2 mask. */
#define CTE_PIFIL2_bp  2  /* Interleave register access bit 2 position. */
#define CTE_PIFIL3_bm  (1<<3)  /* Interleave register access bit 3 mask. */
#define CTE_PIFIL3_bp  3  /* Interleave register access bit 3 position. */
#define CTE_PIFIL4_bm  (1<<4)  /* Interleave register access bit 4 mask. */
#define CTE_PIFIL4_bp  4  /* Interleave register access bit 4 position. */
#define CTE_PIFIL5_bm  (1<<5)  /* Interleave register access bit 5 mask. */
#define CTE_PIFIL5_bp  5  /* Interleave register access bit 5 position. */
#define CTE_PIFIL6_bm  (1<<6)  /* Interleave register access bit 6 mask. */
#define CTE_PIFIL6_bp  6  /* Interleave register access bit 6 position. */
#define CTE_PIFIL7_bm  (1<<7)  /* Interleave register access bit 7 mask. */
#define CTE_PIFIL7_bp  7  /* Interleave register access bit 7 position. */
#define CTE_PIFIL8_bm  (1<<8)  /* Interleave register access bit 8 mask. */
#define CTE_PIFIL8_bp  8  /* Interleave register access bit 8 position. */
#define CTE_PIFIL9_bm  (1<<9)  /* Interleave register access bit 9 mask. */
#define CTE_PIFIL9_bp  9  /* Interleave register access bit 9 position. */
#define CTE_PIFIL10_bm  (1<<10)  /* Interleave register access bit 10 mask. */
#define CTE_PIFIL10_bp  10  /* Interleave register access bit 10 position. */
#define CTE_PIFIL11_bm  (1<<11)  /* Interleave register access bit 11 mask. */
#define CTE_PIFIL11_bp  11  /* Interleave register access bit 11 position. */
#define CTE_PIFIL12_bm  (1<<12)  /* Interleave register access bit 12 mask. */
#define CTE_PIFIL12_bp  12  /* Interleave register access bit 12 position. */
#define CTE_PIFIL13_bm  (1<<13)  /* Interleave register access bit 13 mask. */
#define CTE_PIFIL13_bp  13  /* Interleave register access bit 13 position. */
#define CTE_PIFIL14_bm  (1<<14)  /* Interleave register access bit 14 mask. */
#define CTE_PIFIL14_bp  14  /* Interleave register access bit 14 position. */
#define CTE_PIFIL15_bm  (1<<15)  /* Interleave register access bit 15 mask. */
#define CTE_PIFIL15_bp  15  /* Interleave register access bit 15 position. */

/* CTE.PIFILB  bit masks and bit positions */
/* CTE_PIFIL  is already defined. */

/* CTE.PIFILE  bit masks and bit positions */
/* CTE_PIFIL  is already defined. */

/* CTE.PIFILO  bit masks and bit positions */
/* CTE_PIFIL  is already defined. */

/* CTE.ADCCRA  bit masks and bit positions */
#define CTE_ADCPRESC_gm  0x1F  /* ADC Prescaler Setting group mask. */
#define CTE_ADCPRESC_gp  0  /* ADC Prescaler Setting group position. */
#define CTE_ADCPRESC0_bm  (1<<0)  /* ADC Prescaler Setting bit 0 mask. */
#define CTE_ADCPRESC0_bp  0  /* ADC Prescaler Setting bit 0 position. */
#define CTE_ADCPRESC1_bm  (1<<1)  /* ADC Prescaler Setting bit 1 mask. */
#define CTE_ADCPRESC1_bp  1  /* ADC Prescaler Setting bit 1 position. */
#define CTE_ADCPRESC2_bm  (1<<2)  /* ADC Prescaler Setting bit 2 mask. */
#define CTE_ADCPRESC2_bp  2  /* ADC Prescaler Setting bit 2 position. */
#define CTE_ADCPRESC3_bm  (1<<3)  /* ADC Prescaler Setting bit 3 mask. */
#define CTE_ADCPRESC3_bp  3  /* ADC Prescaler Setting bit 3 position. */
#define CTE_ADCPRESC4_bm  (1<<4)  /* ADC Prescaler Setting bit 4 mask. */
#define CTE_ADCPRESC4_bp  4  /* ADC Prescaler Setting bit 4 position. */
#define CTE_ADCAPS_bm  0x20  /* ADC Auto Power Save bit mask. */
#define CTE_ADCAPS_bp  5  /* ADC Auto Power Save bit position. */
#define CTE_ADCREFSEL_gm  0xC0  /* ADC Reference Select group mask. */
#define CTE_ADCREFSEL_gp  6  /* ADC Reference Select group position. */
#define CTE_ADCREFSEL0_bm  (1<<6)  /* ADC Reference Select bit 0 mask. */
#define CTE_ADCREFSEL0_bp  6  /* ADC Reference Select bit 0 position. */
#define CTE_ADCREFSEL1_bm  (1<<7)  /* ADC Reference Select bit 1 mask. */
#define CTE_ADCREFSEL1_bp  7  /* ADC Reference Select bit 1 position. */
#define CTE_SHSAMP_gm  0x300  /* Sample and Hold sampling mode group mask. */
#define CTE_SHSAMP_gp  8  /* Sample and Hold sampling mode group position. */
#define CTE_SHSAMP0_bm  (1<<8)  /* Sample and Hold sampling mode bit 0 mask. */
#define CTE_SHSAMP0_bp  8  /* Sample and Hold sampling mode bit 0 position. */
#define CTE_SHSAMP1_bm  (1<<9)  /* Sample and Hold sampling mode bit 1 mask. */
#define CTE_SHSAMP1_bp  9  /* Sample and Hold sampling mode bit 1 position. */
#define CTE_SHFALLBACK_bm  0x400  /* Enable fallback from the ADC reference system bit mask. */
#define CTE_SHFALLBACK_bp  10  /* Enable fallback from the ADC reference system bit position. */

/* CTE.ADCCRB  bit masks and bit positions */
#define CTE_ADCSPEED_gm  0x03  /* ADC Speed group mask. */
#define CTE_ADCSPEED_gp  0  /* ADC Speed group position. */
#define CTE_ADCSPEED0_bm  (1<<0)  /* ADC Speed bit 0 mask. */
#define CTE_ADCSPEED0_bp  0  /* ADC Speed bit 0 position. */
#define CTE_ADCSPEED1_bm  (1<<1)  /* ADC Speed bit 1 mask. */
#define CTE_ADCSPEED1_bp  1  /* ADC Speed bit 1 position. */
#define CTE_ADCPUEN_bm  0x04  /* ADC Pull Enable bit mask. */
#define CTE_ADCPUEN_bp  2  /* ADC Pull Enable bit position. */
#define CTE_SHDCS_bm  0x40  /* Sample and Hold Dynamic Current Scaling bit mask. */
#define CTE_SHDCS_bp  6  /* Sample and Hold Dynamic Current Scaling bit position. */
#define CTE_ADCSUM_bm  0x80  /* ADC Startup Mode bit mask. */
#define CTE_ADCSUM_bp  7  /* ADC Startup Mode bit position. */
#define CTE_ADCSUPSD_bm  0x100  /* ADC Startup Power Save Disable bit mask. */
#define CTE_ADCSUPSD_bp  8  /* ADC Startup Power Save Disable bit position. */
#define CTE_ADCPSM_bm  0x200  /* ADC Power Save Mode bit mask. */
#define CTE_ADCPSM_bp  9  /* ADC Power Save Mode bit position. */
#define CTE_ADCSUT_gm  0x1C00  /* ADC Startup Time group mask. */
#define CTE_ADCSUT_gp  10  /* ADC Startup Time group position. */
#define CTE_ADCSUT0_bm  (1<<10)  /* ADC Startup Time bit 0 mask. */
#define CTE_ADCSUT0_bp  10  /* ADC Startup Time bit 0 position. */
#define CTE_ADCSUT1_bm  (1<<11)  /* ADC Startup Time bit 1 mask. */
#define CTE_ADCSUT1_bp  11  /* ADC Startup Time bit 1 position. */
#define CTE_ADCSUT2_bm  (1<<12)  /* ADC Startup Time bit 2 mask. */
#define CTE_ADCSUT2_bp  12  /* ADC Startup Time bit 2 position. */
#define CTE_SHSUT_gm  0xE000  /* Sample and Hold Startup Time group mask. */
#define CTE_SHSUT_gp  13  /* Sample and Hold Startup Time group position. */
#define CTE_SHSUT0_bm  (1<<13)  /* Sample and Hold Startup Time bit 0 mask. */
#define CTE_SHSUT0_bp  13  /* Sample and Hold Startup Time bit 0 position. */
#define CTE_SHSUT1_bm  (1<<14)  /* Sample and Hold Startup Time bit 1 mask. */
#define CTE_SHSUT1_bp  14  /* Sample and Hold Startup Time bit 1 position. */
#define CTE_SHSUT2_bm  (1<<15)  /* Sample and Hold Startup Time bit 2 mask. */
#define CTE_SHSUT2_bp  15  /* Sample and Hold Startup Time bit 2 position. */

/* CTE.ADCINTCAL  bit masks and bit positions */
#define CTE_ADCCALIB_gm  0xFF  /* ADC Calibration Value group mask. */
#define CTE_ADCCALIB_gp  0  /* ADC Calibration Value group position. */
#define CTE_ADCCALIB0_bm  (1<<0)  /* ADC Calibration Value bit 0 mask. */
#define CTE_ADCCALIB0_bp  0  /* ADC Calibration Value bit 0 position. */
#define CTE_ADCCALIB1_bm  (1<<1)  /* ADC Calibration Value bit 1 mask. */
#define CTE_ADCCALIB1_bp  1  /* ADC Calibration Value bit 1 position. */
#define CTE_ADCCALIB2_bm  (1<<2)  /* ADC Calibration Value bit 2 mask. */
#define CTE_ADCCALIB2_bp  2  /* ADC Calibration Value bit 2 position. */
#define CTE_ADCCALIB3_bm  (1<<3)  /* ADC Calibration Value bit 3 mask. */
#define CTE_ADCCALIB3_bp  3  /* ADC Calibration Value bit 3 position. */
#define CTE_ADCCALIB4_bm  (1<<4)  /* ADC Calibration Value bit 4 mask. */
#define CTE_ADCCALIB4_bp  4  /* ADC Calibration Value bit 4 position. */
#define CTE_ADCCALIB5_bm  (1<<5)  /* ADC Calibration Value bit 5 mask. */
#define CTE_ADCCALIB5_bp  5  /* ADC Calibration Value bit 5 position. */
#define CTE_ADCCALIB6_bm  (1<<6)  /* ADC Calibration Value bit 6 mask. */
#define CTE_ADCCALIB6_bp  6  /* ADC Calibration Value bit 6 position. */
#define CTE_ADCCALIB7_bm  (1<<7)  /* ADC Calibration Value bit 7 mask. */
#define CTE_ADCCALIB7_bp  7  /* ADC Calibration Value bit 7 position. */
#define CTE_INTCALIB_gm  0x3F00  /* Integrator Calibration Value group mask. */
#define CTE_INTCALIB_gp  8  /* Integrator Calibration Value group position. */
#define CTE_INTCALIB0_bm  (1<<8)  /* Integrator Calibration Value bit 0 mask. */
#define CTE_INTCALIB0_bp  8  /* Integrator Calibration Value bit 0 position. */
#define CTE_INTCALIB1_bm  (1<<9)  /* Integrator Calibration Value bit 1 mask. */
#define CTE_INTCALIB1_bp  9  /* Integrator Calibration Value bit 1 position. */
#define CTE_INTCALIB2_bm  (1<<10)  /* Integrator Calibration Value bit 2 mask. */
#define CTE_INTCALIB2_bp  10  /* Integrator Calibration Value bit 2 position. */
#define CTE_INTCALIB3_bm  (1<<11)  /* Integrator Calibration Value bit 3 mask. */
#define CTE_INTCALIB3_bp  11  /* Integrator Calibration Value bit 3 position. */
#define CTE_INTCALIB4_bm  (1<<12)  /* Integrator Calibration Value bit 4 mask. */
#define CTE_INTCALIB4_bp  12  /* Integrator Calibration Value bit 4 position. */
#define CTE_INTCALIB5_bm  (1<<13)  /* Integrator Calibration Value bit 5 mask. */
#define CTE_INTCALIB5_bp  13  /* Integrator Calibration Value bit 5 position. */

/* CTE.ADCRES  bit masks and bit positions */
#define CTE_ADCRES_gm  0x3FF  /* ADC Result group mask. */
#define CTE_ADCRES_gp  0  /* ADC Result group position. */
#define CTE_ADCRES0_bm  (1<<0)  /* ADC Result bit 0 mask. */
#define CTE_ADCRES0_bp  0  /* ADC Result bit 0 position. */
#define CTE_ADCRES1_bm  (1<<1)  /* ADC Result bit 1 mask. */
#define CTE_ADCRES1_bp  1  /* ADC Result bit 1 position. */
#define CTE_ADCRES2_bm  (1<<2)  /* ADC Result bit 2 mask. */
#define CTE_ADCRES2_bp  2  /* ADC Result bit 2 position. */
#define CTE_ADCRES3_bm  (1<<3)  /* ADC Result bit 3 mask. */
#define CTE_ADCRES3_bp  3  /* ADC Result bit 3 position. */
#define CTE_ADCRES4_bm  (1<<4)  /* ADC Result bit 4 mask. */
#define CTE_ADCRES4_bp  4  /* ADC Result bit 4 position. */
#define CTE_ADCRES5_bm  (1<<5)  /* ADC Result bit 5 mask. */
#define CTE_ADCRES5_bp  5  /* ADC Result bit 5 position. */
#define CTE_ADCRES6_bm  (1<<6)  /* ADC Result bit 6 mask. */
#define CTE_ADCRES6_bp  6  /* ADC Result bit 6 position. */
#define CTE_ADCRES7_bm  (1<<7)  /* ADC Result bit 7 mask. */
#define CTE_ADCRES7_bp  7  /* ADC Result bit 7 position. */
#define CTE_ADCRES8_bm  (1<<8)  /* ADC Result bit 8 mask. */
#define CTE_ADCRES8_bp  8  /* ADC Result bit 8 position. */
#define CTE_ADCRES9_bm  (1<<9)  /* ADC Result bit 9 mask. */
#define CTE_ADCRES9_bp  9  /* ADC Result bit 9 position. */
#define CTE_ADCRESCH_gm  0x7C00  /* ADC Result Channel group mask. */
#define CTE_ADCRESCH_gp  10  /* ADC Result Channel group position. */
#define CTE_ADCRESCH0_bm  (1<<10)  /* ADC Result Channel bit 0 mask. */
#define CTE_ADCRESCH0_bp  10  /* ADC Result Channel bit 0 position. */
#define CTE_ADCRESCH1_bm  (1<<11)  /* ADC Result Channel bit 1 mask. */
#define CTE_ADCRESCH1_bp  11  /* ADC Result Channel bit 1 position. */
#define CTE_ADCRESCH2_bm  (1<<12)  /* ADC Result Channel bit 2 mask. */
#define CTE_ADCRESCH2_bp  12  /* ADC Result Channel bit 2 position. */
#define CTE_ADCRESCH3_bm  (1<<13)  /* ADC Result Channel bit 3 mask. */
#define CTE_ADCRESCH3_bp  13  /* ADC Result Channel bit 3 position. */
#define CTE_ADCRESCH4_bm  (1<<14)  /* ADC Result Channel bit 4 mask. */
#define CTE_ADCRESCH4_bp  14  /* ADC Result Channel bit 4 position. */
#define CTE_ADCRESAUX_bm  0x8000  /* ADC Result Auxillary Channel bit mask. */
#define CTE_ADCRESAUX_bp  15  /* ADC Result Auxillary Channel bit position. */

/* CTE.ADCINTTEST  bit masks and bit positions */
#define CTE_ADCTSPEN_bm  0x01  /* ADC Test Switch P Enable bit mask. */
#define CTE_ADCTSPEN_bp  0  /* ADC Test Switch P Enable bit position. */
#define CTE_ADCTSNEN_bm  0x02  /* ADC Test Switch N Enable bit mask. */
#define CTE_ADCTSNEN_bp  1  /* ADC Test Switch N Enable bit position. */
#define CTE_ADCBTESTEN_bm  0x04  /* ADC Bias Test Enable bit mask. */
#define CTE_ADCBTESTEN_bp  2  /* ADC Bias Test Enable bit position. */
#define CTE_ADCFV_bm  0x08  /* ADC Force Valid Conversion bit mask. */
#define CTE_ADCFV_bp  3  /* ADC Force Valid Conversion bit position. */
#define CTE_INTBIST_bm  0x10  /* Integrator BIST Enable bit mask. */
#define CTE_INTBIST_bp  4  /* Integrator BIST Enable bit position. */
#define CTE_INTY0TIEN_bm  0x20  /* Integrator Y0 Test Input Enable bit mask. */
#define CTE_INTY0TIEN_bp  5  /* Integrator Y0 Test Input Enable bit position. */
#define CTE_INTY1TIEN_bm  0x40  /* Integrator Y1 Test Input Enable bit mask. */
#define CTE_INTY1TIEN_bp  6  /* Integrator Y1 Test Input Enable bit position. */
#define CTE_INTTESTSEL_gm  0x1F00  /* Integrator Test Mode Selection group mask. */
#define CTE_INTTESTSEL_gp  8  /* Integrator Test Mode Selection group position. */
#define CTE_INTTESTSEL0_bm  (1<<8)  /* Integrator Test Mode Selection bit 0 mask. */
#define CTE_INTTESTSEL0_bp  8  /* Integrator Test Mode Selection bit 0 position. */
#define CTE_INTTESTSEL1_bm  (1<<9)  /* Integrator Test Mode Selection bit 1 mask. */
#define CTE_INTTESTSEL1_bp  9  /* Integrator Test Mode Selection bit 1 position. */
#define CTE_INTTESTSEL2_bm  (1<<10)  /* Integrator Test Mode Selection bit 2 mask. */
#define CTE_INTTESTSEL2_bp  10  /* Integrator Test Mode Selection bit 2 position. */
#define CTE_INTTESTSEL3_bm  (1<<11)  /* Integrator Test Mode Selection bit 3 mask. */
#define CTE_INTTESTSEL3_bp  11  /* Integrator Test Mode Selection bit 3 position. */
#define CTE_INTTESTSEL4_bm  (1<<12)  /* Integrator Test Mode Selection bit 4 mask. */
#define CTE_INTTESTSEL4_bp  12  /* Integrator Test Mode Selection bit 4 position. */

/* CTE.ADCSHVBCAL  bit masks and bit positions */
#define CTE_ADCVBCAL_gm  0x0F  /* ADC VBias Calibration group mask. */
#define CTE_ADCVBCAL_gp  0  /* ADC VBias Calibration group position. */
#define CTE_ADCVBCAL0_bm  (1<<0)  /* ADC VBias Calibration bit 0 mask. */
#define CTE_ADCVBCAL0_bp  0  /* ADC VBias Calibration bit 0 position. */
#define CTE_ADCVBCAL1_bm  (1<<1)  /* ADC VBias Calibration bit 1 mask. */
#define CTE_ADCVBCAL1_bp  1  /* ADC VBias Calibration bit 1 position. */
#define CTE_ADCVBCAL2_bm  (1<<2)  /* ADC VBias Calibration bit 2 mask. */
#define CTE_ADCVBCAL2_bp  2  /* ADC VBias Calibration bit 2 position. */
#define CTE_ADCVBCAL3_bm  (1<<3)  /* ADC VBias Calibration bit 3 mask. */
#define CTE_ADCVBCAL3_bp  3  /* ADC VBias Calibration bit 3 position. */
#define CTE_ADCVBSEL_bm  0x10  /* ADC VBias Select bit mask. */
#define CTE_ADCVBSEL_bp  4  /* ADC VBias Select bit position. */
#define CTE_SHVBCAL_gm  0xE0  /* S/H VBias Calibration group mask. */
#define CTE_SHVBCAL_gp  5  /* S/H VBias Calibration group position. */
#define CTE_SHVBCAL0_bm  (1<<5)  /* S/H VBias Calibration bit 0 mask. */
#define CTE_SHVBCAL0_bp  5  /* S/H VBias Calibration bit 0 position. */
#define CTE_SHVBCAL1_bm  (1<<6)  /* S/H VBias Calibration bit 1 mask. */
#define CTE_SHVBCAL1_bp  6  /* S/H VBias Calibration bit 1 position. */
#define CTE_SHVBCAL2_bm  (1<<7)  /* S/H VBias Calibration bit 2 mask. */
#define CTE_SHVBCAL2_bp  7  /* S/H VBias Calibration bit 2 position. */
#define CTE_SHVBSEL_bm  0x100  /* S/H VBias Select bit mask. */
#define CTE_SHVBSEL_bp  8  /* S/H VBias Select bit position. */

/* CTE.INTCRA  bit masks and bit positions */
#define CTE_INTMEN_bm  0x01  /* Integrator Master Enable bit mask. */
#define CTE_INTMEN_bp  0  /* Integrator Master Enable bit position. */
#define CTE_INTARST_bm  0x02  /* Integrator Automatic Reset bit mask. */
#define CTE_INTARST_bp  1  /* Integrator Automatic Reset bit position. */
#define CTE_INTAST_bm  0x04  /* Integrator Automatic Sign Toggle bit mask. */
#define CTE_INTAST_bp  2  /* Integrator Automatic Sign Toggle bit position. */
#define CTE_INTRSTSEL_bm  0x08  /* Integrator Reset Select bit mask. */
#define CTE_INTRSTSEL_bp  3  /* Integrator Reset Select bit position. */
#define CTE_INTINCBIAS_bm  0x40  /* Integrator Increase Bias bit mask. */
#define CTE_INTINCBIAS_bp  6  /* Integrator Increase Bias bit position. */
#define CTE_INTXCHINC_bm  0x80  /* Integrator X-channel Increment bit mask. */
#define CTE_INTXCHINC_bp  7  /* Integrator X-channel Increment bit position. */
#define CTE_INTRSTEN_bm  0x100  /* Integrator Reset Enable bit mask. */
#define CTE_INTRSTEN_bp  8  /* Integrator Reset Enable bit position. */
#define CTE_INTRSTCOMPEN_bm  0x200  /* Integrator Reset Comparator Enable bit mask. */
#define CTE_INTRSTCOMPEN_bp  9  /* Integrator Reset Comparator Enable bit position. */
#define CTE_INTRSTSYSEN_bm  0x400  /* Integrator Reset System Enable bit mask. */
#define CTE_INTRSTSYSEN_bp  10  /* Integrator Reset System Enable bit position. */
#define CTE_INTDBIAS_bm  0x800  /* Integrator Double Bias bit mask. */
#define CTE_INTDBIAS_bp  11  /* Integrator Double Bias bit position. */
#define CTE_INTCALDC_bm  0x1000  /* Integrator Calibration Double Current bit mask. */
#define CTE_INTCALDC_bp  12  /* Integrator Calibration Double Current bit position. */
#define CTE_INTIAMPCALEN_bm  0x2000  /* Integrator Current Amplifier Calibration Enable bit mask. */
#define CTE_INTIAMPCALEN_bp  13  /* Integrator Current Amplifier Calibration Enable bit position. */
#define CTE_BIASXEN_bm  0x4000  /* X-Line Bias Enable bit mask. */
#define CTE_BIASXEN_bp  14  /* X-Line Bias Enable bit position. */
#define CTE_BIASYEN_bm  0x8000  /* Y-Line Bias Enable bit mask. */
#define CTE_BIASYEN_bp  15  /* Y-Line Bias Enable bit position. */

/* CTE.INTCRD  bit masks and bit positions */
#define CTE_SCENX1_bm  0x01  /* Selfcap Enable X1 bit mask. */
#define CTE_SCENX1_bp  0  /* Selfcap Enable X1 bit position. */
#define CTE_SCENX2_bm  0x02  /* Selfcap Enable X2 bit mask. */
#define CTE_SCENX2_bp  1  /* Selfcap Enable X2 bit position. */
#define CTE_SCENY1_bm  0x04  /* Selfcap Enable Y1 bit mask. */
#define CTE_SCENY1_bp  2  /* Selfcap Enable Y1 bit position. */
#define CTE_BIASY30U_bm  0x08  /* Y-Line Bias Nominal Value 30uA bit mask. */
#define CTE_BIASY30U_bp  3  /* Y-Line Bias Nominal Value 30uA bit position. */
#define CTE_INTCINTBYPASS_bm  0x10  /* Integrator Cint bypass bit mask. */
#define CTE_INTCINTBYPASS_bp  4  /* Integrator Cint bypass bit position. */
#define CTE_TIMABSCCTRL_bm  0x20  /* Timer A/B Selfcap Control bit mask. */
#define CTE_TIMABSCCTRL_bp  5  /* Timer A/B Selfcap Control bit position. */
#define CTE_SCHOT_gm  0x700  /* Selfcap Hold-Off Time group mask. */
#define CTE_SCHOT_gp  8  /* Selfcap Hold-Off Time group position. */
#define CTE_SCHOT0_bm  (1<<8)  /* Selfcap Hold-Off Time bit 0 mask. */
#define CTE_SCHOT0_bp  8  /* Selfcap Hold-Off Time bit 0 position. */
#define CTE_SCHOT1_bm  (1<<9)  /* Selfcap Hold-Off Time bit 1 mask. */
#define CTE_SCHOT1_bp  9  /* Selfcap Hold-Off Time bit 1 position. */
#define CTE_SCHOT2_bm  (1<<10)  /* Selfcap Hold-Off Time bit 2 mask. */
#define CTE_SCHOT2_bp  10  /* Selfcap Hold-Off Time bit 2 position. */

