gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.INTENA  bit masks and bit positions */
#define CTE_INTEN_gm  0xFFFF  /* Integrator Enable group mask. */
#define CTE_INTEN_gp  0  /* Integrator Enable group position. */
#define CTE_INTEN0_bm  (1<<0)  /* Integrator Enable bit 0 mask. */
#define CTE_INTEN0_bp  0  /* Integrator Enable bit 0 position. */
#define CTE_INTEN1_bm  (1<<1)  /* Integrator Enable bit 1 mask. */
#define CTE_INTEN1_bp  1  /* Integrator Enable bit 1 position. */
#define CTE_INTEN2_bm  (1<<2)  /* Integrator Enable bit 2 mask. */
#define CTE_INTEN2_bp  2  /* Integrator Enable bit 2 position. */
#define CTE_INTEN3_bm  (1<<3)  /* Integrator Enable bit 3 mask. */
#define CTE_INTEN3_bp  3  /* Integrator Enable bit 3 position. */
#define CTE_INTEN4_bm  (1<<4)  /* Integrator Enable bit 4 mask. */
#define CTE_INTEN4_bp  4  /* Integrator Enable bit 4 position. */
#define CTE_INTEN5_bm  (1<<5)  /* Integrator Enable bit 5 mask. */
#define CTE_INTEN5_bp  5  /* Integrator Enable bit 5 position. */
#define CTE_INTEN6_bm  (1<<6)  /* Integrator Enable bit 6 mask. */
#define CTE_INTEN6_bp  6  /* Integrator Enable bit 6 position. */
#define CTE_INTEN7_bm  (1<<7)  /* Integrator Enable bit 7 mask. */
#define CTE_INTEN7_bp  7  /* Integrator Enable bit 7 position. */
#define CTE_INTEN8_bm  (1<<8)  /* Integrator Enable bit 8 mask. */
#define CTE_INTEN8_bp  8  /* Integrator Enable bit 8 position. */
#define CTE_INTEN9_bm  (1<<9)  /* Integrator Enable bit 9 mask. */
#define CTE_INTEN9_bp  9  /* Integrator Enable bit 9 position. */
#define CTE_INTEN10_bm  (1<<10)  /* Integrator Enable bit 10 mask. */
#define CTE_INTEN10_bp  10  /* Integrator Enable bit 10 position. */
#define CTE_INTEN11_bm  (1<<11)  /* Integrator Enable bit 11 mask. */
#define CTE_INTEN11_bp  11  /* Integrator Enable bit 11 position. */
#define CTE_INTEN12_bm  (1<<12)  /* Integrator Enable bit 12 mask. */
#define CTE_INTEN12_bp  12  /* Integrator Enable bit 12 position. */
#define CTE_INTEN13_bm  (1<<13)  /* Integrator Enable bit 13 mask. */
#define CTE_INTEN13_bp  13  /* Integrator Enable bit 13 position. */
#define CTE_INTEN14_bm  (1<<14)  /* Integrator Enable bit 14 mask. */
#define CTE_INTEN14_bp  14  /* Integrator Enable bit 14 position. */
#define CTE_INTEN15_bm  (1<<15)  /* Integrator Enable bit 15 mask. */
#define CTE_INTEN15_bp  15  /* Integrator Enable bit 15 position. */

/* CTE.INTENB  bit masks and bit positions */
/* CTE_INTEN  is already defined. */

/* CTE.INTMASKENA  bit masks and bit positions */
#define CTE_INTMASKEN_gm  0xFFFF  /* Integrator Mask Enable group mask. */
#define CTE_INTMASKEN_gp  0  /* Integrator Mask Enable group position. */
#define CTE_INTMASKEN0_bm  (1<<0)  /* Integrator Mask Enable bit 0 mask. */
#define CTE_INTMASKEN0_bp  0  /* Integrator Mask Enable bit 0 position. */
#define CTE_INTMASKEN1_bm  (1<<1)  /* Integrator Mask Enable bit 1 mask. */
#define CTE_INTMASKEN1_bp  1  /* Integrator Mask Enable bit 1 position. */
#define CTE_INTMASKEN2_bm  (1<<2)  /* Integrator Mask Enable bit 2 mask. */
#define CTE_INTMASKEN2_bp  2  /* Integrator Mask Enable bit 2 position. */
#define CTE_INTMASKEN3_bm  (1<<3)  /* Integrator Mask Enable bit 3 mask. */
#define CTE_INTMASKEN3_bp  3  /* Integrator Mask Enable bit 3 position. */
#define CTE_INTMASKEN4_bm  (1<<4)  /* Integrator Mask Enable bit 4 mask. */
#define CTE_INTMASKEN4_bp  4  /* Integrator Mask Enable bit 4 position. */
#define CTE_INTMASKEN5_bm  (1<<5)  /* Integrator Mask Enable bit 5 mask. */
#define CTE_INTMASKEN5_bp  5  /* Integrator Mask Enable bit 5 position. */
#define CTE_INTMASKEN6_bm  (1<<6)  /* Integrator Mask Enable bit 6 mask. */
#define CTE_INTMASKEN6_bp  6  /* Integrator Mask Enable bit 6 position. */
#define CTE_INTMASKEN7_bm  (1<<7)  /* Integrator Mask Enable bit 7 mask. */
#define CTE_INTMASKEN7_bp  7  /* Integrator Mask Enable bit 7 position. */
#define CTE_INTMASKEN8_bm  (1<<8)  /* Integrator Mask Enable bit 8 mask. */
#define CTE_INTMASKEN8_bp  8  /* Integrator Mask Enable bit 8 position. */
#define CTE_INTMASKEN9_bm  (1<<9)  /* Integrator Mask Enable bit 9 mask. */
#define CTE_INTMASKEN9_bp  9  /* Integrator Mask Enable bit 9 position. */
#define CTE_INTMASKEN10_bm  (1<<10)  /* Integrator Mask Enable bit 10 mask. */
#define CTE_INTMASKEN10_bp  10  /* Integrator Mask Enable bit 10 position. */
#define CTE_INTMASKEN11_bm  (1<<11)  /* Integrator Mask Enable bit 11 mask. */
#define CTE_INTMASKEN11_bp  11  /* Integrator Mask Enable bit 11 position. */
#define CTE_INTMASKEN12_bm  (1<<12)  /* Integrator Mask Enable bit 12 mask. */
#define CTE_INTMASKEN12_bp  12  /* Integrator Mask Enable bit 12 position. */
#define CTE_INTMASKEN13_bm  (1<<13)  /* Integrator Mask Enable bit 13 mask. */
#define CTE_INTMASKEN13_bp  13  /* Integrator Mask Enable bit 13 position. */
#define CTE_INTMASKEN14_bm  (1<<14)  /* Integrator Mask Enable bit 14 mask. */
#define CTE_INTMASKEN14_bp  14  /* Integrator Mask Enable bit 14 position. */
#define CTE_INTMASKEN15_bm  (1<<15)  /* Integrator Mask Enable bit 15 mask. */
#define CTE_INTMASKEN15_bp  15  /* Integrator Mask Enable bit 15 position. */

/* CTE.INTMASKENB  bit masks and bit positions */
/* CTE_INTMASKEN  is already defined. */

/* CTE.SHENA  bit masks and bit positions */
#define CTE_SHEN_gm  0xFFFF  /* Sample and Hold Enable group mask. */
#define CTE_SHEN_gp  0  /* Sample and Hold Enable group position. */
#define CTE_SHEN0_bm  (1<<0)  /* Sample and Hold Enable bit 0 mask. */
#define CTE_SHEN0_bp  0  /* Sample and Hold Enable bit 0 position. */
#define CTE_SHEN1_bm  (1<<1)  /* Sample and Hold Enable bit 1 mask. */
#define CTE_SHEN1_bp  1  /* Sample and Hold Enable bit 1 position. */
#define CTE_SHEN2_bm  (1<<2)  /* Sample and Hold Enable bit 2 mask. */
#define CTE_SHEN2_bp  2  /* Sample and Hold Enable bit 2 position. */
#define CTE_SHEN3_bm  (1<<3)  /* Sample and Hold Enable bit 3 mask. */
#define CTE_SHEN3_bp  3  /* Sample and Hold Enable bit 3 position. */
#define CTE_SHEN4_bm  (1<<4)  /* Sample and Hold Enable bit 4 mask. */
#define CTE_SHEN4_bp  4  /* Sample and Hold Enable bit 4 position. */
#define CTE_SHEN5_bm  (1<<5)  /* Sample and Hold Enable bit 5 mask. */
#define CTE_SHEN5_bp  5  /* Sample and Hold Enable bit 5 position. */
#define CTE_SHEN6_bm  (1<<6)  /* Sample and Hold Enable bit 6 mask. */
#define CTE_SHEN6_bp  6  /* Sample and Hold Enable bit 6 position. */
#define CTE_SHEN7_bm  (1<<7)  /* Sample and Hold Enable bit 7 mask. */
#define CTE_SHEN7_bp  7  /* Sample and Hold Enable bit 7 position. */
#define CTE_SHEN8_bm  (1<<8)  /* Sample and Hold Enable bit 8 mask. */
#define CTE_SHEN8_bp  8  /* Sample and Hold Enable bit 8 position. */
#define CTE_SHEN9_bm  (1<<9)  /* Sample and Hold Enable bit 9 mask. */
#define CTE_SHEN9_bp  9  /* Sample and Hold Enable bit 9 position. */
#define CTE_SHEN10_bm  (1<<10)  /* Sample and Hold Enable bit 10 mask. */
#define CTE_SHEN10_bp  10  /* Sample and Hold Enable bit 10 position. */
#define CTE_SHEN11_bm  (1<<11)  /* Sample and Hold Enable bit 11 mask. */
#define CTE_SHEN11_bp  11  /* Sample and Hold Enable bit 11 position. */
#define CTE_SHEN12_bm  (1<<12)  /* Sample and Hold Enable bit 12 mask. */
#define CTE_SHEN12_bp  12  /* Sample and Hold Enable bit 12 position. */
#define CTE_SHEN13_bm  (1<<13)  /* Sample and Hold Enable bit 13 mask. */
#define CTE_SHEN13_bp  13  /* Sample and Hold Enable bit 13 position. */
#define CTE_SHEN14_bm  (1<<14)  /* Sample and Hold Enable bit 14 mask. */
#define CTE_SHEN14_bp  14  /* Sample and Hold Enable bit 14 position. */
#define CTE_SHEN15_bm  (1<<15)  /* Sample and Hold Enable bit 15 mask. */
#define CTE_SHEN15_bp  15  /* Sample and Hold Enable bit 15 position. */

/* CTE.SHENB  bit masks and bit positions */
/* CTE_SHEN  is already defined. */

