gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.BIASCR  bit masks and bit positions */
#define CTE_BIASXFT_gm  0x1F  /* X-Line Bias P Value (Fall Time) group mask. */
#define CTE_BIASXFT_gp  0  /* X-Line Bias P Value (Fall Time) group position. */
#define CTE_BIASXFT0_bm  (1<<0)  /* X-Line Bias P Value (Fall Time) bit 0 mask. */
#define CTE_BIASXFT0_bp  0  /* X-Line Bias P Value (Fall Time) bit 0 position. */
#define CTE_BIASXFT1_bm  (1<<1)  /* X-Line Bias P Value (Fall Time) bit 1 mask. */
#define CTE_BIASXFT1_bp  1  /* X-Line Bias P Value (Fall Time) bit 1 position. */
#define CTE_BIASXFT2_bm  (1<<2)  /* X-Line Bias P Value (Fall Time) bit 2 mask. */
#define CTE_BIASXFT2_bp  2  /* X-Line Bias P Value (Fall Time) bit 2 position. */
#define CTE_BIASXFT3_bm  (1<<3)  /* X-Line Bias P Value (Fall Time) bit 3 mask. */
#define CTE_BIASXFT3_bp  3  /* X-Line Bias P Value (Fall Time) bit 3 position. */
#define CTE_BIASXFT4_bm  (1<<4)  /* X-Line Bias P Value (Fall Time) bit 4 mask. */
#define CTE_BIASXFT4_bp  4  /* X-Line Bias P Value (Fall Time) bit 4 position. */
#define CTE_BIASXRT_gm  0x3E0  /* X-Line Bias N Value (Rise Time) group mask. */
#define CTE_BIASXRT_gp  5  /* X-Line Bias N Value (Rise Time) group position. */
#define CTE_BIASXRT0_bm  (1<<5)  /* X-Line Bias N Value (Rise Time) bit 0 mask. */
#define CTE_BIASXRT0_bp  5  /* X-Line Bias N Value (Rise Time) bit 0 position. */
#define CTE_BIASXRT1_bm  (1<<6)  /* X-Line Bias N Value (Rise Time) bit 1 mask. */
#define CTE_BIASXRT1_bp  6  /* X-Line Bias N Value (Rise Time) bit 1 position. */
#define CTE_BIASXRT2_bm  (1<<7)  /* X-Line Bias N Value (Rise Time) bit 2 mask. */
#define CTE_BIASXRT2_bp  7  /* X-Line Bias N Value (Rise Time) bit 2 position. */
#define CTE_BIASXRT3_bm  (1<<8)  /* X-Line Bias N Value (Rise Time) bit 3 mask. */
#define CTE_BIASXRT3_bp  8  /* X-Line Bias N Value (Rise Time) bit 3 position. */
#define CTE_BIASXRT4_bm  (1<<9)  /* X-Line Bias N Value (Rise Time) bit 4 mask. */
#define CTE_BIASXRT4_bp  9  /* X-Line Bias N Value (Rise Time) bit 4 position. */
#define CTE_BIASYVAL_gm  0xF000  /* Y-Line Bias Value group mask. */
#define CTE_BIASYVAL_gp  12  /* Y-Line Bias Value group position. */
#define CTE_BIASYVAL0_bm  (1<<12)  /* Y-Line Bias Value bit 0 mask. */
#define CTE_BIASYVAL0_bp  12  /* Y-Line Bias Value bit 0 position. */
#define CTE_BIASYVAL1_bm  (1<<13)  /* Y-Line Bias Value bit 1 mask. */
#define CTE_BIASYVAL1_bp  13  /* Y-Line Bias Value bit 1 position. */
#define CTE_BIASYVAL2_bm  (1<<14)  /* Y-Line Bias Value bit 2 mask. */
#define CTE_BIASYVAL2_bp  14  /* Y-Line Bias Value bit 2 position. */
#define CTE_BIASYVAL3_bm  (1<<15)  /* Y-Line Bias Value bit 3 mask. */
#define CTE_BIASYVAL3_bp  15  /* Y-Line Bias Value bit 3 position. */

/* CTE.HVSEQT  bit masks and bit positions */
#define CTE_HVHOT_gm  0xFF  /* High Voltage Hold Off Time group mask. */
#define CTE_HVHOT_gp  0  /* High Voltage Hold Off Time group position. */
#define CTE_HVHOT0_bm  (1<<0)  /* High Voltage Hold Off Time bit 0 mask. */
#define CTE_HVHOT0_bp  0  /* High Voltage Hold Off Time bit 0 position. */
#define CTE_HVHOT1_bm  (1<<1)  /* High Voltage Hold Off Time bit 1 mask. */
#define CTE_HVHOT1_bp  1  /* High Voltage Hold Off Time bit 1 position. */
#define CTE_HVHOT2_bm  (1<<2)  /* High Voltage Hold Off Time bit 2 mask. */
#define CTE_HVHOT2_bp  2  /* High Voltage Hold Off Time bit 2 position. */
#define CTE_HVHOT3_bm  (1<<3)  /* High Voltage Hold Off Time bit 3 mask. */
#define CTE_HVHOT3_bp  3  /* High Voltage Hold Off Time bit 3 position. */
#define CTE_HVHOT4_bm  (1<<4)  /* High Voltage Hold Off Time bit 4 mask. */
#define CTE_HVHOT4_bp  4  /* High Voltage Hold Off Time bit 4 position. */
#define CTE_HVHOT5_bm  (1<<5)  /* High Voltage Hold Off Time bit 5 mask. */
#define CTE_HVHOT5_bp  5  /* High Voltage Hold Off Time bit 5 position. */
#define CTE_HVHOT6_bm  (1<<6)  /* High Voltage Hold Off Time bit 6 mask. */
#define CTE_HVHOT6_bp  6  /* High Voltage Hold Off Time bit 6 position. */
#define CTE_HVHOT7_bm  (1<<7)  /* High Voltage Hold Off Time bit 7 mask. */
#define CTE_HVHOT7_bp  7  /* High Voltage Hold Off Time bit 7 position. */
#define CTE_HVCT_gm  0xFF00  /* High Voltage Charge Time group mask. */
#define CTE_HVCT_gp  8  /* High Voltage Charge Time group position. */
#define CTE_HVCT0_bm  (1<<8)  /* High Voltage Charge Time bit 0 mask. */
#define CTE_HVCT0_bp  8  /* High Voltage Charge Time bit 0 position. */
#define CTE_HVCT1_bm  (1<<9)  /* High Voltage Charge Time bit 1 mask. */
#define CTE_HVCT1_bp  9  /* High Voltage Charge Time bit 1 position. */
#define CTE_HVCT2_bm  (1<<10)  /* High Voltage Charge Time bit 2 mask. */
#define CTE_HVCT2_bp  10  /* High Voltage Charge Time bit 2 position. */
#define CTE_HVCT3_bm  (1<<11)  /* High Voltage Charge Time bit 3 mask. */
#define CTE_HVCT3_bp  11  /* High Voltage Charge Time bit 3 position. */
#define CTE_HVCT4_bm  (1<<12)  /* High Voltage Charge Time bit 4 mask. */
#define CTE_HVCT4_bp  12  /* High Voltage Charge Time bit 4 position. */
#define CTE_HVCT5_bm  (1<<13)  /* High Voltage Charge Time bit 5 mask. */
#define CTE_HVCT5_bp  13  /* High Voltage Charge Time bit 5 position. */
#define CTE_HVCT6_bm  (1<<14)  /* High Voltage Charge Time bit 6 mask. */
#define CTE_HVCT6_bp  14  /* High Voltage Charge Time bit 6 position. */
#define CTE_HVCT7_bm  (1<<15)  /* High Voltage Charge Time bit 7 mask. */
#define CTE_HVCT7_bp  15  /* High Voltage Charge Time bit 7 position. */

/* CTE.INTXCHMAX  bit masks and bit positions */
#define CTE_INTXCHMAX_gm  0x3F  /* Maximum X-channel Number group mask. */
#define CTE_INTXCHMAX_gp  0  /* Maximum X-channel Number group position. */
#define CTE_INTXCHMAX0_bm  (1<<0)  /* Maximum X-channel Number bit 0 mask. */
#define CTE_INTXCHMAX0_bp  0  /* Maximum X-channel Number bit 0 position. */
#define CTE_INTXCHMAX1_bm  (1<<1)  /* Maximum X-channel Number bit 1 mask. */
#define CTE_INTXCHMAX1_bp  1  /* Maximum X-channel Number bit 1 position. */
#define CTE_INTXCHMAX2_bm  (1<<2)  /* Maximum X-channel Number bit 2 mask. */
#define CTE_INTXCHMAX2_bp  2  /* Maximum X-channel Number bit 2 position. */
#define CTE_INTXCHMAX3_bm  (1<<3)  /* Maximum X-channel Number bit 3 mask. */
#define CTE_INTXCHMAX3_bp  3  /* Maximum X-channel Number bit 3 position. */
#define CTE_INTXCHMAX4_bm  (1<<4)  /* Maximum X-channel Number bit 4 mask. */
#define CTE_INTXCHMAX4_bp  4  /* Maximum X-channel Number bit 4 position. */
#define CTE_INTXCHMAX5_bm  (1<<5)  /* Maximum X-channel Number bit 5 mask. */
#define CTE_INTXCHMAX5_bp  5  /* Maximum X-channel Number bit 5 position. */

