gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.INTCAPRSTCR  bit masks and bit positions */
#define CTE_INTCAPRSTTA_gm  0x07  /* Integrator Cap Reset Time A group mask. */
#define CTE_INTCAPRSTTA_gp  0  /* Integrator Cap Reset Time A group position. */
#define CTE_INTCAPRSTTA0_bm  (1<<0)  /* Integrator Cap Reset Time A bit 0 mask. */
#define CTE_INTCAPRSTTA0_bp  0  /* Integrator Cap Reset Time A bit 0 position. */
#define CTE_INTCAPRSTTA1_bm  (1<<1)  /* Integrator Cap Reset Time A bit 1 mask. */
#define CTE_INTCAPRSTTA1_bp  1  /* Integrator Cap Reset Time A bit 1 position. */
#define CTE_INTCAPRSTTA2_bm  (1<<2)  /* Integrator Cap Reset Time A bit 2 mask. */
#define CTE_INTCAPRSTTA2_bp  2  /* Integrator Cap Reset Time A bit 2 position. */
#define CTE_INTCAPRSTTB_gm  0x70  /* Integrator Cap Reset Time B group mask. */
#define CTE_INTCAPRSTTB_gp  4  /* Integrator Cap Reset Time B group position. */
#define CTE_INTCAPRSTTB0_bm  (1<<4)  /* Integrator Cap Reset Time B bit 0 mask. */
#define CTE_INTCAPRSTTB0_bp  4  /* Integrator Cap Reset Time B bit 0 position. */
#define CTE_INTCAPRSTTB1_bm  (1<<5)  /* Integrator Cap Reset Time B bit 1 mask. */
#define CTE_INTCAPRSTTB1_bp  5  /* Integrator Cap Reset Time B bit 1 position. */
#define CTE_INTCAPRSTTB2_bm  (1<<6)  /* Integrator Cap Reset Time B bit 2 mask. */
#define CTE_INTCAPRSTTB2_bp  6  /* Integrator Cap Reset Time B bit 2 position. */

/* CTE.INTGAIN0  bit masks and bit positions */
#define CTE_INT0GAIN_gm  0x0F  /* Integrator Gain 0 group mask. */
#define CTE_INT0GAIN_gp  0  /* Integrator Gain 0 group position. */
#define CTE_INT0GAIN0_bm  (1<<0)  /* Integrator Gain 0 bit 0 mask. */
#define CTE_INT0GAIN0_bp  0  /* Integrator Gain 0 bit 0 position. */
#define CTE_INT0GAIN1_bm  (1<<1)  /* Integrator Gain 0 bit 1 mask. */
#define CTE_INT0GAIN1_bp  1  /* Integrator Gain 0 bit 1 position. */
#define CTE_INT0GAIN2_bm  (1<<2)  /* Integrator Gain 0 bit 2 mask. */
#define CTE_INT0GAIN2_bp  2  /* Integrator Gain 0 bit 2 position. */
#define CTE_INT0GAIN3_bm  (1<<3)  /* Integrator Gain 0 bit 3 mask. */
#define CTE_INT0GAIN3_bp  3  /* Integrator Gain 0 bit 3 position. */
#define CTE_INT1GAIN_gm  0xF0  /* Integrator Gain 1 group mask. */
#define CTE_INT1GAIN_gp  4  /* Integrator Gain 1 group position. */
#define CTE_INT1GAIN0_bm  (1<<4)  /* Integrator Gain 1 bit 0 mask. */
#define CTE_INT1GAIN0_bp  4  /* Integrator Gain 1 bit 0 position. */
#define CTE_INT1GAIN1_bm  (1<<5)  /* Integrator Gain 1 bit 1 mask. */
#define CTE_INT1GAIN1_bp  5  /* Integrator Gain 1 bit 1 position. */
#define CTE_INT1GAIN2_bm  (1<<6)  /* Integrator Gain 1 bit 2 mask. */
#define CTE_INT1GAIN2_bp  6  /* Integrator Gain 1 bit 2 position. */
#define CTE_INT1GAIN3_bm  (1<<7)  /* Integrator Gain 1 bit 3 mask. */
#define CTE_INT1GAIN3_bp  7  /* Integrator Gain 1 bit 3 position. */
#define CTE_INT2GAIN_gm  0xF00  /* Integrator Gain 2 group mask. */
#define CTE_INT2GAIN_gp  8  /* Integrator Gain 2 group position. */
#define CTE_INT2GAIN0_bm  (1<<8)  /* Integrator Gain 2 bit 0 mask. */
#define CTE_INT2GAIN0_bp  8  /* Integrator Gain 2 bit 0 position. */
#define CTE_INT2GAIN1_bm  (1<<9)  /* Integrator Gain 2 bit 1 mask. */
#define CTE_INT2GAIN1_bp  9  /* Integrator Gain 2 bit 1 position. */
#define CTE_INT2GAIN2_bm  (1<<10)  /* Integrator Gain 2 bit 2 mask. */
#define CTE_INT2GAIN2_bp  10  /* Integrator Gain 2 bit 2 position. */
#define CTE_INT2GAIN3_bm  (1<<11)  /* Integrator Gain 2 bit 3 mask. */
#define CTE_INT2GAIN3_bp  11  /* Integrator Gain 2 bit 3 position. */
#define CTE_INT3GAIN_gm  0xF000  /* Integrator Gain 3 group mask. */
#define CTE_INT3GAIN_gp  12  /* Integrator Gain 3 group position. */
#define CTE_INT3GAIN0_bm  (1<<12)  /* Integrator Gain 3 bit 0 mask. */
#define CTE_INT3GAIN0_bp  12  /* Integrator Gain 3 bit 0 position. */
#define CTE_INT3GAIN1_bm  (1<<13)  /* Integrator Gain 3 bit 1 mask. */
#define CTE_INT3GAIN1_bp  13  /* Integrator Gain 3 bit 1 position. */
#define CTE_INT3GAIN2_bm  (1<<14)  /* Integrator Gain 3 bit 2 mask. */
#define CTE_INT3GAIN2_bp  14  /* Integrator Gain 3 bit 2 position. */
#define CTE_INT3GAIN3_bm  (1<<15)  /* Integrator Gain 3 bit 3 mask. */
#define CTE_INT3GAIN3_bp  15  /* Integrator Gain 3 bit 3 position. */

/* CTE.INTGAIN1  bit masks and bit positions */
#define CTE_INT4GAIN_gm  0x0F  /* Integrator Gain 4 group mask. */
#define CTE_INT4GAIN_gp  0  /* Integrator Gain 4 group position. */
#define CTE_INT4GAIN0_bm  (1<<0)  /* Integrator Gain 4 bit 0 mask. */
#define CTE_INT4GAIN0_bp  0  /* Integrator Gain 4 bit 0 position. */
#define CTE_INT4GAIN1_bm  (1<<1)  /* Integrator Gain 4 bit 1 mask. */
#define CTE_INT4GAIN1_bp  1  /* Integrator Gain 4 bit 1 position. */
#define CTE_INT4GAIN2_bm  (1<<2)  /* Integrator Gain 4 bit 2 mask. */
#define CTE_INT4GAIN2_bp  2  /* Integrator Gain 4 bit 2 position. */
#define CTE_INT4GAIN3_bm  (1<<3)  /* Integrator Gain 4 bit 3 mask. */
#define CTE_INT4GAIN3_bp  3  /* Integrator Gain 4 bit 3 position. */
#define CTE_INT5GAIN_gm  0xF0  /* Integrator Gain 5 group mask. */
#define CTE_INT5GAIN_gp  4  /* Integrator Gain 5 group position. */
#define CTE_INT5GAIN0_bm  (1<<4)  /* Integrator Gain 5 bit 0 mask. */
#define CTE_INT5GAIN0_bp  4  /* Integrator Gain 5 bit 0 position. */
#define CTE_INT5GAIN1_bm  (1<<5)  /* Integrator Gain 5 bit 1 mask. */
#define CTE_INT5GAIN1_bp  5  /* Integrator Gain 5 bit 1 position. */
#define CTE_INT5GAIN2_bm  (1<<6)  /* Integrator Gain 5 bit 2 mask. */
#define CTE_INT5GAIN2_bp  6  /* Integrator Gain 5 bit 2 position. */
#define CTE_INT5GAIN3_bm  (1<<7)  /* Integrator Gain 5 bit 3 mask. */
#define CTE_INT5GAIN3_bp  7  /* Integrator Gain 5 bit 3 position. */
#define CTE_INT6GAIN_gm  0xF00  /* Integrator Gain 6 group mask. */
#define CTE_INT6GAIN_gp  8  /* Integrator Gain 6 group position. */
#define CTE_INT6GAIN0_bm  (1<<8)  /* Integrator Gain 6 bit 0 mask. */
#define CTE_INT6GAIN0_bp  8  /* Integrator Gain 6 bit 0 position. */
#define CTE_INT6GAIN1_bm  (1<<9)  /* Integrator Gain 6 bit 1 mask. */
#define CTE_INT6GAIN1_bp  9  /* Integrator Gain 6 bit 1 position. */
#define CTE_INT6GAIN2_bm  (1<<10)  /* Integrator Gain 6 bit 2 mask. */
#define CTE_INT6GAIN2_bp  10  /* Integrator Gain 6 bit 2 position. */
#define CTE_INT6GAIN3_bm  (1<<11)  /* Integrator Gain 6 bit 3 mask. */
#define CTE_INT6GAIN3_bp  11  /* Integrator Gain 6 bit 3 position. */
#define CTE_INT7GAIN_gm  0xF000  /* Integrator Gain 7 group mask. */
#define CTE_INT7GAIN_gp  12  /* Integrator Gain 7 group position. */
#define CTE_INT7GAIN0_bm  (1<<12)  /* Integrator Gain 7 bit 0 mask. */
#define CTE_INT7GAIN0_bp  12  /* Integrator Gain 7 bit 0 position. */
#define CTE_INT7GAIN1_bm  (1<<13)  /* Integrator Gain 7 bit 1 mask. */
#define CTE_INT7GAIN1_bp  13  /* Integrator Gain 7 bit 1 position. */
#define CTE_INT7GAIN2_bm  (1<<14)  /* Integrator Gain 7 bit 2 mask. */
#define CTE_INT7GAIN2_bp  14  /* Integrator Gain 7 bit 2 position. */
#define CTE_INT7GAIN3_bm  (1<<15)  /* Integrator Gain 7 bit 3 mask. */
#define CTE_INT7GAIN3_bp  15  /* Integrator Gain 7 bit 3 position. */

/* CTE.INTGAIN2  bit masks and bit positions */
#define CTE_INT8GAIN_gm  0x0F  /* Integrator Gain 8 group mask. */
#define CTE_INT8GAIN_gp  0  /* Integrator Gain 8 group position. */
#define CTE_INT8GAIN0_bm  (1<<0)  /* Integrator Gain 8 bit 0 mask. */
#define CTE_INT8GAIN0_bp  0  /* Integrator Gain 8 bit 0 position. */
#define CTE_INT8GAIN1_bm  (1<<1)  /* Integrator Gain 8 bit 1 mask. */
#define CTE_INT8GAIN1_bp  1  /* Integrator Gain 8 bit 1 position. */
#define CTE_INT8GAIN2_bm  (1<<2)  /* Integrator Gain 8 bit 2 mask. */
#define CTE_INT8GAIN2_bp  2  /* Integrator Gain 8 bit 2 position. */
#define CTE_INT8GAIN3_bm  (1<<3)  /* Integrator Gain 8 bit 3 mask. */
#define CTE_INT8GAIN3_bp  3  /* Integrator Gain 8 bit 3 position. */
#define CTE_INT9GAIN_gm  0xF0  /* Integrator Gain 9 group mask. */
#define CTE_INT9GAIN_gp  4  /* Integrator Gain 9 group position. */
#define CTE_INT9GAIN0_bm  (1<<4)  /* Integrator Gain 9 bit 0 mask. */
#define CTE_INT9GAIN0_bp  4  /* Integrator Gain 9 bit 0 position. */
#define CTE_INT9GAIN1_bm  (1<<5)  /* Integrator Gain 9 bit 1 mask. */
#define CTE_INT9GAIN1_bp  5  /* Integrator Gain 9 bit 1 position. */
#define CTE_INT9GAIN2_bm  (1<<6)  /* Integrator Gain 9 bit 2 mask. */
#define CTE_INT9GAIN2_bp  6  /* Integrator Gain 9 bit 2 position. */
#define CTE_INT9GAIN3_bm  (1<<7)  /* Integrator Gain 9 bit 3 mask. */
#define CTE_INT9GAIN3_bp  7  /* Integrator Gain 9 bit 3 position. */
#define CTE_INT10GAIN_gm  0xF00  /* Integrator Gain 10 group mask. */
#define CTE_INT10GAIN_gp  8  /* Integrator Gain 10 group position. */
#define CTE_INT10GAIN0_bm  (1<<8)  /* Integrator Gain 10 bit 0 mask. */
#define CTE_INT10GAIN0_bp  8  /* Integrator Gain 10 bit 0 position. */
#define CTE_INT10GAIN1_bm  (1<<9)  /* Integrator Gain 10 bit 1 mask. */
#define CTE_INT10GAIN1_bp  9  /* Integrator Gain 10 bit 1 position. */
#define CTE_INT10GAIN2_bm  (1<<10)  /* Integrator Gain 10 bit 2 mask. */
#define CTE_INT10GAIN2_bp  10  /* Integrator Gain 10 bit 2 position. */
#define CTE_INT10GAIN3_bm  (1<<11)  /* Integrator Gain 10 bit 3 mask. */
#define CTE_INT10GAIN3_bp  11  /* Integrator Gain 10 bit 3 position. */
#define CTE_INT11GAIN_gm  0xF000  /* Integrator Gain 11 group mask. */
#define CTE_INT11GAIN_gp  12  /* Integrator Gain 11 group position. */
#define CTE_INT11GAIN0_bm  (1<<12)  /* Integrator Gain 11 bit 0 mask. */
#define CTE_INT11GAIN0_bp  12  /* Integrator Gain 11 bit 0 position. */
#define CTE_INT11GAIN1_bm  (1<<13)  /* Integrator Gain 11 bit 1 mask. */
#define CTE_INT11GAIN1_bp  13  /* Integrator Gain 11 bit 1 position. */
#define CTE_INT11GAIN2_bm  (1<<14)  /* Integrator Gain 11 bit 2 mask. */
#define CTE_INT11GAIN2_bp  14  /* Integrator Gain 11 bit 2 position. */
#define CTE_INT11GAIN3_bm  (1<<15)  /* Integrator Gain 11 bit 3 mask. */
#define CTE_INT11GAIN3_bp  15  /* Integrator Gain 11 bit 3 position. */

/* CTE.INTGAIN3  bit masks and bit positions */
#define CTE_INT12GAIN_gm  0x0F  /* Integrator Gain 12 group mask. */
#define CTE_INT12GAIN_gp  0  /* Integrator Gain 12 group position. */
#define CTE_INT12GAIN0_bm  (1<<0)  /* Integrator Gain 12 bit 0 mask. */
#define CTE_INT12GAIN0_bp  0  /* Integrator Gain 12 bit 0 position. */
#define CTE_INT12GAIN1_bm  (1<<1)  /* Integrator Gain 12 bit 1 mask. */
#define CTE_INT12GAIN1_bp  1  /* Integrator Gain 12 bit 1 position. */
#define CTE_INT12GAIN2_bm  (1<<2)  /* Integrator Gain 12 bit 2 mask. */
#define CTE_INT12GAIN2_bp  2  /* Integrator Gain 12 bit 2 position. */
#define CTE_INT12GAIN3_bm  (1<<3)  /* Integrator Gain 12 bit 3 mask. */
#define CTE_INT12GAIN3_bp  3  /* Integrator Gain 12 bit 3 position. */
#define CTE_INT13GAIN_gm  0xF0  /* Integrator Gain 13 group mask. */
#define CTE_INT13GAIN_gp  4  /* Integrator Gain 13 group position. */
#define CTE_INT13GAIN0_bm  (1<<4)  /* Integrator Gain 13 bit 0 mask. */
#define CTE_INT13GAIN0_bp  4  /* Integrator Gain 13 bit 0 position. */
#define CTE_INT13GAIN1_bm  (1<<5)  /* Integrator Gain 13 bit 1 mask. */
#define CTE_INT13GAIN1_bp  5  /* Integrator Gain 13 bit 1 position. */
#define CTE_INT13GAIN2_bm  (1<<6)  /* Integrator Gain 13 bit 2 mask. */
#define CTE_INT13GAIN2_bp  6  /* Integrator Gain 13 bit 2 position. */
#define CTE_INT13GAIN3_bm  (1<<7)  /* Integrator Gain 13 bit 3 mask. */
#define CTE_INT13GAIN3_bp  7  /* Integrator Gain 13 bit 3 position. */
#define CTE_INT14GAIN_gm  0xF00  /* Integrator Gain 14 group mask. */
#define CTE_INT14GAIN_gp  8  /* Integrator Gain 14 group position. */
#define CTE_INT14GAIN0_bm  (1<<8)  /* Integrator Gain 14 bit 0 mask. */
#define CTE_INT14GAIN0_bp  8  /* Integrator Gain 14 bit 0 position. */
#define CTE_INT14GAIN1_bm  (1<<9)  /* Integrator Gain 14 bit 1 mask. */
#define CTE_INT14GAIN1_bp  9  /* Integrator Gain 14 bit 1 position. */
#define CTE_INT14GAIN2_bm  (1<<10)  /* Integrator Gain 14 bit 2 mask. */
#define CTE_INT14GAIN2_bp  10  /* Integrator Gain 14 bit 2 position. */
#define CTE_INT14GAIN3_bm  (1<<11)  /* Integrator Gain 14 bit 3 mask. */
#define CTE_INT14GAIN3_bp  11  /* Integrator Gain 14 bit 3 position. */
#define CTE_INT15GAIN_gm  0xF000  /* Integrator Gain 15 group mask. */
#define CTE_INT15GAIN_gp  12  /* Integrator Gain 15 group position. */
#define CTE_INT15GAIN0_bm  (1<<12)  /* Integrator Gain 15 bit 0 mask. */
#define CTE_INT15GAIN0_bp  12  /* Integrator Gain 15 bit 0 position. */
#define CTE_INT15GAIN1_bm  (1<<13)  /* Integrator Gain 15 bit 1 mask. */
#define CTE_INT15GAIN1_bp  13  /* Integrator Gain 15 bit 1 position. */
#define CTE_INT15GAIN2_bm  (1<<14)  /* Integrator Gain 15 bit 2 mask. */
#define CTE_INT15GAIN2_bp  14  /* Integrator Gain 15 bit 2 position. */
#define CTE_INT15GAIN3_bm  (1<<15)  /* Integrator Gain 15 bit 3 mask. */
#define CTE_INT15GAIN3_bp  15  /* Integrator Gain 15 bit 3 position. */

