gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PADYCHCOMPB  bit masks and bit positions */
/* CTE_PADYCHCOMP  is already defined. */

/* CTE.PADBNY1  bit masks and bit positions */
#define CTE_SCBNY1A_gm  0xFF  /* Current source nmos calibration Y1 A group mask. */
#define CTE_SCBNY1A_gp  0  /* Current source nmos calibration Y1 A group position. */
#define CTE_SCBNY1A0_bm  (1<<0)  /* Current source nmos calibration Y1 A bit 0 mask. */
#define CTE_SCBNY1A0_bp  0  /* Current source nmos calibration Y1 A bit 0 position. */
#define CTE_SCBNY1A1_bm  (1<<1)  /* Current source nmos calibration Y1 A bit 1 mask. */
#define CTE_SCBNY1A1_bp  1  /* Current source nmos calibration Y1 A bit 1 position. */
#define CTE_SCBNY1A2_bm  (1<<2)  /* Current source nmos calibration Y1 A bit 2 mask. */
#define CTE_SCBNY1A2_bp  2  /* Current source nmos calibration Y1 A bit 2 position. */
#define CTE_SCBNY1A3_bm  (1<<3)  /* Current source nmos calibration Y1 A bit 3 mask. */
#define CTE_SCBNY1A3_bp  3  /* Current source nmos calibration Y1 A bit 3 position. */
#define CTE_SCBNY1A4_bm  (1<<4)  /* Current source nmos calibration Y1 A bit 4 mask. */
#define CTE_SCBNY1A4_bp  4  /* Current source nmos calibration Y1 A bit 4 position. */
#define CTE_SCBNY1A5_bm  (1<<5)  /* Current source nmos calibration Y1 A bit 5 mask. */
#define CTE_SCBNY1A5_bp  5  /* Current source nmos calibration Y1 A bit 5 position. */
#define CTE_SCBNY1A6_bm  (1<<6)  /* Current source nmos calibration Y1 A bit 6 mask. */
#define CTE_SCBNY1A6_bp  6  /* Current source nmos calibration Y1 A bit 6 position. */
#define CTE_SCBNY1A7_bm  (1<<7)  /* Current source nmos calibration Y1 A bit 7 mask. */
#define CTE_SCBNY1A7_bp  7  /* Current source nmos calibration Y1 A bit 7 position. */
#define CTE_SCBNY1B_gm  0xFF00  /* Current source nmos calibration Y1 B group mask. */
#define CTE_SCBNY1B_gp  8  /* Current source nmos calibration Y1 B group position. */
#define CTE_SCBNY1B0_bm  (1<<8)  /* Current source nmos calibration Y1 B bit 0 mask. */
#define CTE_SCBNY1B0_bp  8  /* Current source nmos calibration Y1 B bit 0 position. */
#define CTE_SCBNY1B1_bm  (1<<9)  /* Current source nmos calibration Y1 B bit 1 mask. */
#define CTE_SCBNY1B1_bp  9  /* Current source nmos calibration Y1 B bit 1 position. */
#define CTE_SCBNY1B2_bm  (1<<10)  /* Current source nmos calibration Y1 B bit 2 mask. */
#define CTE_SCBNY1B2_bp  10  /* Current source nmos calibration Y1 B bit 2 position. */
#define CTE_SCBNY1B3_bm  (1<<11)  /* Current source nmos calibration Y1 B bit 3 mask. */
#define CTE_SCBNY1B3_bp  11  /* Current source nmos calibration Y1 B bit 3 position. */
#define CTE_SCBNY1B4_bm  (1<<12)  /* Current source nmos calibration Y1 B bit 4 mask. */
#define CTE_SCBNY1B4_bp  12  /* Current source nmos calibration Y1 B bit 4 position. */
#define CTE_SCBNY1B5_bm  (1<<13)  /* Current source nmos calibration Y1 B bit 5 mask. */
#define CTE_SCBNY1B5_bp  13  /* Current source nmos calibration Y1 B bit 5 position. */
#define CTE_SCBNY1B6_bm  (1<<14)  /* Current source nmos calibration Y1 B bit 6 mask. */
#define CTE_SCBNY1B6_bp  14  /* Current source nmos calibration Y1 B bit 6 position. */
#define CTE_SCBNY1B7_bm  (1<<15)  /* Current source nmos calibration Y1 B bit 7 mask. */
#define CTE_SCBNY1B7_bp  15  /* Current source nmos calibration Y1 B bit 7 position. */

/* CTE.PADBPY1  bit masks and bit positions */
#define CTE_SCBPY1A_gm  0xFF  /* Current source pmos calibration Y1 A group mask. */
#define CTE_SCBPY1A_gp  0  /* Current source pmos calibration Y1 A group position. */
#define CTE_SCBPY1A0_bm  (1<<0)  /* Current source pmos calibration Y1 A bit 0 mask. */
#define CTE_SCBPY1A0_bp  0  /* Current source pmos calibration Y1 A bit 0 position. */
#define CTE_SCBPY1A1_bm  (1<<1)  /* Current source pmos calibration Y1 A bit 1 mask. */
#define CTE_SCBPY1A1_bp  1  /* Current source pmos calibration Y1 A bit 1 position. */
#define CTE_SCBPY1A2_bm  (1<<2)  /* Current source pmos calibration Y1 A bit 2 mask. */
#define CTE_SCBPY1A2_bp  2  /* Current source pmos calibration Y1 A bit 2 position. */
#define CTE_SCBPY1A3_bm  (1<<3)  /* Current source pmos calibration Y1 A bit 3 mask. */
#define CTE_SCBPY1A3_bp  3  /* Current source pmos calibration Y1 A bit 3 position. */
#define CTE_SCBPY1A4_bm  (1<<4)  /* Current source pmos calibration Y1 A bit 4 mask. */
#define CTE_SCBPY1A4_bp  4  /* Current source pmos calibration Y1 A bit 4 position. */
#define CTE_SCBPY1A5_bm  (1<<5)  /* Current source pmos calibration Y1 A bit 5 mask. */
#define CTE_SCBPY1A5_bp  5  /* Current source pmos calibration Y1 A bit 5 position. */
#define CTE_SCBPY1A6_bm  (1<<6)  /* Current source pmos calibration Y1 A bit 6 mask. */
#define CTE_SCBPY1A6_bp  6  /* Current source pmos calibration Y1 A bit 6 position. */
#define CTE_SCBPY1A7_bm  (1<<7)  /* Current source pmos calibration Y1 A bit 7 mask. */
#define CTE_SCBPY1A7_bp  7  /* Current source pmos calibration Y1 A bit 7 position. */
#define CTE_SCBPY1B_gm  0xFF00  /* Current source pmos calibration Y1 B group mask. */
#define CTE_SCBPY1B_gp  8  /* Current source pmos calibration Y1 B group position. */
#define CTE_SCBPY1B0_bm  (1<<8)  /* Current source pmos calibration Y1 B bit 0 mask. */
#define CTE_SCBPY1B0_bp  8  /* Current source pmos calibration Y1 B bit 0 position. */
#define CTE_SCBPY1B1_bm  (1<<9)  /* Current source pmos calibration Y1 B bit 1 mask. */
#define CTE_SCBPY1B1_bp  9  /* Current source pmos calibration Y1 B bit 1 position. */
#define CTE_SCBPY1B2_bm  (1<<10)  /* Current source pmos calibration Y1 B bit 2 mask. */
#define CTE_SCBPY1B2_bp  10  /* Current source pmos calibration Y1 B bit 2 position. */
#define CTE_SCBPY1B3_bm  (1<<11)  /* Current source pmos calibration Y1 B bit 3 mask. */
#define CTE_SCBPY1B3_bp  11  /* Current source pmos calibration Y1 B bit 3 position. */
#define CTE_SCBPY1B4_bm  (1<<12)  /* Current source pmos calibration Y1 B bit 4 mask. */
#define CTE_SCBPY1B4_bp  12  /* Current source pmos calibration Y1 B bit 4 position. */
#define CTE_SCBPY1B5_bm  (1<<13)  /* Current source pmos calibration Y1 B bit 5 mask. */
#define CTE_SCBPY1B5_bp  13  /* Current source pmos calibration Y1 B bit 5 position. */
#define CTE_SCBPY1B6_bm  (1<<14)  /* Current source pmos calibration Y1 B bit 6 mask. */
#define CTE_SCBPY1B6_bp  14  /* Current source pmos calibration Y1 B bit 6 position. */
#define CTE_SCBPY1B7_bm  (1<<15)  /* Current source pmos calibration Y1 B bit 7 mask. */
#define CTE_SCBPY1B7_bp  15  /* Current source pmos calibration Y1 B bit 7 position. */

/* CTE.PADY1  bit masks and bit positions */
#define CTE_SCEXTRAPYA_gm  0x0F  /* Enable extra pmos calibration Y1 A group mask. */
#define CTE_SCEXTRAPYA_gp  0  /* Enable extra pmos calibration Y1 A group position. */
#define CTE_SCEXTRAPYA0_bm  (1<<0)  /* Enable extra pmos calibration Y1 A bit 0 mask. */
#define CTE_SCEXTRAPYA0_bp  0  /* Enable extra pmos calibration Y1 A bit 0 position. */
#define CTE_SCEXTRAPYA1_bm  (1<<1)  /* Enable extra pmos calibration Y1 A bit 1 mask. */
#define CTE_SCEXTRAPYA1_bp  1  /* Enable extra pmos calibration Y1 A bit 1 position. */
#define CTE_SCEXTRAPYA2_bm  (1<<2)  /* Enable extra pmos calibration Y1 A bit 2 mask. */
#define CTE_SCEXTRAPYA2_bp  2  /* Enable extra pmos calibration Y1 A bit 2 position. */
#define CTE_SCEXTRAPYA3_bm  (1<<3)  /* Enable extra pmos calibration Y1 A bit 3 mask. */
#define CTE_SCEXTRAPYA3_bp  3  /* Enable extra pmos calibration Y1 A bit 3 position. */
#define CTE_SCEXTRAPYB_gm  0xF0  /* Enable extra pmos calibration Y1 B group mask. */
#define CTE_SCEXTRAPYB_gp  4  /* Enable extra pmos calibration Y1 B group position. */
#define CTE_SCEXTRAPYB0_bm  (1<<4)  /* Enable extra pmos calibration Y1 B bit 0 mask. */
#define CTE_SCEXTRAPYB0_bp  4  /* Enable extra pmos calibration Y1 B bit 0 position. */
#define CTE_SCEXTRAPYB1_bm  (1<<5)  /* Enable extra pmos calibration Y1 B bit 1 mask. */
#define CTE_SCEXTRAPYB1_bp  5  /* Enable extra pmos calibration Y1 B bit 1 position. */
#define CTE_SCEXTRAPYB2_bm  (1<<6)  /* Enable extra pmos calibration Y1 B bit 2 mask. */
#define CTE_SCEXTRAPYB2_bp  6  /* Enable extra pmos calibration Y1 B bit 2 position. */
#define CTE_SCEXTRAPYB3_bm  (1<<7)  /* Enable extra pmos calibration Y1 B bit 3 mask. */
#define CTE_SCEXTRAPYB3_bp  7  /* Enable extra pmos calibration Y1 B bit 3 position. */
#define CTE_SCEXTRANYA_gm  0xF00  /* Enable extra nmos calibration Y1 A group mask. */
#define CTE_SCEXTRANYA_gp  8  /* Enable extra nmos calibration Y1 A group position. */
#define CTE_SCEXTRANYA0_bm  (1<<8)  /* Enable extra nmos calibration Y1 A bit 0 mask. */
#define CTE_SCEXTRANYA0_bp  8  /* Enable extra nmos calibration Y1 A bit 0 position. */
#define CTE_SCEXTRANYA1_bm  (1<<9)  /* Enable extra nmos calibration Y1 A bit 1 mask. */
#define CTE_SCEXTRANYA1_bp  9  /* Enable extra nmos calibration Y1 A bit 1 position. */
#define CTE_SCEXTRANYA2_bm  (1<<10)  /* Enable extra nmos calibration Y1 A bit 2 mask. */
#define CTE_SCEXTRANYA2_bp  10  /* Enable extra nmos calibration Y1 A bit 2 position. */
#define CTE_SCEXTRANYA3_bm  (1<<11)  /* Enable extra nmos calibration Y1 A bit 3 mask. */
#define CTE_SCEXTRANYA3_bp  11  /* Enable extra nmos calibration Y1 A bit 3 position. */
#define CTE_SCEXTRANYB_gm  0xF000  /* Enable extra nmos calibration Y1 B group mask. */
#define CTE_SCEXTRANYB_gp  12  /* Enable extra nmos calibration Y1 B group position. */
#define CTE_SCEXTRANYB0_bm  (1<<12)  /* Enable extra nmos calibration Y1 B bit 0 mask. */
#define CTE_SCEXTRANYB0_bp  12  /* Enable extra nmos calibration Y1 B bit 0 position. */
#define CTE_SCEXTRANYB1_bm  (1<<13)  /* Enable extra nmos calibration Y1 B bit 1 mask. */
#define CTE_SCEXTRANYB1_bp  13  /* Enable extra nmos calibration Y1 B bit 1 position. */
#define CTE_SCEXTRANYB2_bm  (1<<14)  /* Enable extra nmos calibration Y1 B bit 2 mask. */
#define CTE_SCEXTRANYB2_bp  14  /* Enable extra nmos calibration Y1 B bit 2 position. */
#define CTE_SCEXTRANYB3_bm  (1<<15)  /* Enable extra nmos calibration Y1 B bit 3 mask. */
#define CTE_SCEXTRANYB3_bp  15  /* Enable extra nmos calibration Y1 B bit 3 position. */

/* CTE.XYBIAS  bit masks and bit positions */
#define CTE_XBIASX1EN_bm  0x01  /* Bias X1 Enable bit mask. */
#define CTE_XBIASX1EN_bp  0  /* Bias X1 Enable bit position. */
#define CTE_SELSRX1_gm  0x06  /* Select Slew Rate X1 group mask. */
#define CTE_SELSRX1_gp  1  /* Select Slew Rate X1 group position. */
#define CTE_SELSRX10_bm  (1<<1)  /* Select Slew Rate X1 bit 0 mask. */
#define CTE_SELSRX10_bp  1  /* Select Slew Rate X1 bit 0 position. */
#define CTE_SELSRX11_bm  (1<<2)  /* Select Slew Rate X1 bit 1 mask. */
#define CTE_SELSRX11_bp  2  /* Select Slew Rate X1 bit 1 position. */
#define CTE_XBIASX2EN_bm  0x08  /* Bias X2 Enable bit mask. */
#define CTE_XBIASX2EN_bp  3  /* Bias X2 Enable bit position. */
#define CTE_SELSRX2_gm  0x30  /* Select Slew Rate X2 group mask. */
#define CTE_SELSRX2_gp  4  /* Select Slew Rate X2 group position. */
#define CTE_SELSRX20_bm  (1<<4)  /* Select Slew Rate X2 bit 0 mask. */
#define CTE_SELSRX20_bp  4  /* Select Slew Rate X2 bit 0 position. */
#define CTE_SELSRX21_bm  (1<<5)  /* Select Slew Rate X2 bit 1 mask. */
#define CTE_SELSRX21_bp  5  /* Select Slew Rate X2 bit 1 position. */
#define CTE_XBIASY1EN_bm  0x100  /* Bias Y1 Enable bit mask. */
#define CTE_XBIASY1EN_bp  8  /* Bias Y1 Enable bit position. */
#define CTE_SELSRY1_gm  0x600  /* Select Slew Rate Y1 group mask. */
#define CTE_SELSRY1_gp  9  /* Select Slew Rate Y1 group position. */
#define CTE_SELSRY10_bm  (1<<9)  /* Select Slew Rate Y1 bit 0 mask. */
#define CTE_SELSRY10_bp  9  /* Select Slew Rate Y1 bit 0 position. */
#define CTE_SELSRY11_bm  (1<<10)  /* Select Slew Rate Y1 bit 1 mask. */
#define CTE_SELSRY11_bp  10  /* Select Slew Rate Y1 bit 1 position. */

/* CTE.PADSCOEXA  bit masks and bit positions */
#define CTE_PADSCOEX_gm  0xFFFF  /* Pad Self Cap Output Enable X group mask. */
#define CTE_PADSCOEX_gp  0  /* Pad Self Cap Output Enable X group position. */
#define CTE_PADSCOEX0_bm  (1<<0)  /* Pad Self Cap Output Enable X bit 0 mask. */
#define CTE_PADSCOEX0_bp  0  /* Pad Self Cap Output Enable X bit 0 position. */
#define CTE_PADSCOEX1_bm  (1<<1)  /* Pad Self Cap Output Enable X bit 1 mask. */
#define CTE_PADSCOEX1_bp  1  /* Pad Self Cap Output Enable X bit 1 position. */
#define CTE_PADSCOEX2_bm  (1<<2)  /* Pad Self Cap Output Enable X bit 2 mask. */
#define CTE_PADSCOEX2_bp  2  /* Pad Self Cap Output Enable X bit 2 position. */
#define CTE_PADSCOEX3_bm  (1<<3)  /* Pad Self Cap Output Enable X bit 3 mask. */
#define CTE_PADSCOEX3_bp  3  /* Pad Self Cap Output Enable X bit 3 position. */
#define CTE_PADSCOEX4_bm  (1<<4)  /* Pad Self Cap Output Enable X bit 4 mask. */
#define CTE_PADSCOEX4_bp  4  /* Pad Self Cap Output Enable X bit 4 position. */
#define CTE_PADSCOEX5_bm  (1<<5)  /* Pad Self Cap Output Enable X bit 5 mask. */
#define CTE_PADSCOEX5_bp  5  /* Pad Self Cap Output Enable X bit 5 position. */
#define CTE_PADSCOEX6_bm  (1<<6)  /* Pad Self Cap Output Enable X bit 6 mask. */
#define CTE_PADSCOEX6_bp  6  /* Pad Self Cap Output Enable X bit 6 position. */
#define CTE_PADSCOEX7_bm  (1<<7)  /* Pad Self Cap Output Enable X bit 7 mask. */
#define CTE_PADSCOEX7_bp  7  /* Pad Self Cap Output Enable X bit 7 position. */
#define CTE_PADSCOEX8_bm  (1<<8)  /* Pad Self Cap Output Enable X bit 8 mask. */
#define CTE_PADSCOEX8_bp  8  /* Pad Self Cap Output Enable X bit 8 position. */
#define CTE_PADSCOEX9_bm  (1<<9)  /* Pad Self Cap Output Enable X bit 9 mask. */
#define CTE_PADSCOEX9_bp  9  /* Pad Self Cap Output Enable X bit 9 position. */
#define CTE_PADSCOEX10_bm  (1<<10)  /* Pad Self Cap Output Enable X bit 10 mask. */
#define CTE_PADSCOEX10_bp  10  /* Pad Self Cap Output Enable X bit 10 position. */
#define CTE_PADSCOEX11_bm  (1<<11)  /* Pad Self Cap Output Enable X bit 11 mask. */
#define CTE_PADSCOEX11_bp  11  /* Pad Self Cap Output Enable X bit 11 position. */
#define CTE_PADSCOEX12_bm  (1<<12)  /* Pad Self Cap Output Enable X bit 12 mask. */
#define CTE_PADSCOEX12_bp  12  /* Pad Self Cap Output Enable X bit 12 position. */
#define CTE_PADSCOEX13_bm  (1<<13)  /* Pad Self Cap Output Enable X bit 13 mask. */
#define CTE_PADSCOEX13_bp  13  /* Pad Self Cap Output Enable X bit 13 position. */
#define CTE_PADSCOEX14_bm  (1<<14)  /* Pad Self Cap Output Enable X bit 14 mask. */
#define CTE_PADSCOEX14_bp  14  /* Pad Self Cap Output Enable X bit 14 position. */
#define CTE_PADSCOEX15_bm  (1<<15)  /* Pad Self Cap Output Enable X bit 15 mask. */
#define CTE_PADSCOEX15_bp  15  /* Pad Self Cap Output Enable X bit 15 position. */

