gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PADSCX32  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX33  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX34  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX35  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX36  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX37  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX38  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX39  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX40  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX41  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX42  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX43  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX44  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX45  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX46  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX47  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX48  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX49  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX50  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX51  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX52  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX53  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX54  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX55  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX56  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX57  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX58  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCX59  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXB  is already defined. */

/* CTE.PADSCY0  bit masks and bit positions */
#define CTE_PADSCYA_gm  0x1F  /* Pad Self Cap Control Registers Y A group mask. */
#define CTE_PADSCYA_gp  0  /* Pad Self Cap Control Registers Y A group position. */
#define CTE_PADSCYA0_bm  (1<<0)  /* Pad Self Cap Control Registers Y A bit 0 mask. */
#define CTE_PADSCYA0_bp  0  /* Pad Self Cap Control Registers Y A bit 0 position. */
#define CTE_PADSCYA1_bm  (1<<1)  /* Pad Self Cap Control Registers Y A bit 1 mask. */
#define CTE_PADSCYA1_bp  1  /* Pad Self Cap Control Registers Y A bit 1 position. */
#define CTE_PADSCYA2_bm  (1<<2)  /* Pad Self Cap Control Registers Y A bit 2 mask. */
#define CTE_PADSCYA2_bp  2  /* Pad Self Cap Control Registers Y A bit 2 position. */
#define CTE_PADSCYA3_bm  (1<<3)  /* Pad Self Cap Control Registers Y A bit 3 mask. */
#define CTE_PADSCYA3_bp  3  /* Pad Self Cap Control Registers Y A bit 3 position. */
#define CTE_PADSCYA4_bm  (1<<4)  /* Pad Self Cap Control Registers Y A bit 4 mask. */
#define CTE_PADSCYA4_bp  4  /* Pad Self Cap Control Registers Y A bit 4 position. */
#define CTE_PADSCYB_gm  0x1F00  /* Pad Self Cap Control Registers Y B group mask. */
#define CTE_PADSCYB_gp  8  /* Pad Self Cap Control Registers Y B group position. */
#define CTE_PADSCYB0_bm  (1<<8)  /* Pad Self Cap Control Registers Y B bit 0 mask. */
#define CTE_PADSCYB0_bp  8  /* Pad Self Cap Control Registers Y B bit 0 position. */
#define CTE_PADSCYB1_bm  (1<<9)  /* Pad Self Cap Control Registers Y B bit 1 mask. */
#define CTE_PADSCYB1_bp  9  /* Pad Self Cap Control Registers Y B bit 1 position. */
#define CTE_PADSCYB2_bm  (1<<10)  /* Pad Self Cap Control Registers Y B bit 2 mask. */
#define CTE_PADSCYB2_bp  10  /* Pad Self Cap Control Registers Y B bit 2 position. */
#define CTE_PADSCYB3_bm  (1<<11)  /* Pad Self Cap Control Registers Y B bit 3 mask. */
#define CTE_PADSCYB3_bp  11  /* Pad Self Cap Control Registers Y B bit 3 position. */
#define CTE_PADSCYB4_bm  (1<<12)  /* Pad Self Cap Control Registers Y B bit 4 mask. */
#define CTE_PADSCYB4_bp  12  /* Pad Self Cap Control Registers Y B bit 4 position. */

/* CTE.PADSCY1  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY2  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY3  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY4  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY5  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

