gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PADSCY6  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY7  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY8  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY9  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY10  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY11  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY12  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY13  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY14  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY15  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY16  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY17  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY18  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY19  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY20  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY21  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY22  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY23  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY24  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY25  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY26  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY27  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY28  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY29  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY30  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY31  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY32  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY33  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY34  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADSCY35  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYB  is already defined. */

/* CTE.PADHVSWENA  bit masks and bit positions */
#define CTE_PADHVSWEN_gm  0xFFFF  /* Pad hvsw Enable group mask. */
#define CTE_PADHVSWEN_gp  0  /* Pad hvsw Enable group position. */
#define CTE_PADHVSWEN0_bm  (1<<0)  /* Pad hvsw Enable bit 0 mask. */
#define CTE_PADHVSWEN0_bp  0  /* Pad hvsw Enable bit 0 position. */
#define CTE_PADHVSWEN1_bm  (1<<1)  /* Pad hvsw Enable bit 1 mask. */
#define CTE_PADHVSWEN1_bp  1  /* Pad hvsw Enable bit 1 position. */
#define CTE_PADHVSWEN2_bm  (1<<2)  /* Pad hvsw Enable bit 2 mask. */
#define CTE_PADHVSWEN2_bp  2  /* Pad hvsw Enable bit 2 position. */
#define CTE_PADHVSWEN3_bm  (1<<3)  /* Pad hvsw Enable bit 3 mask. */
#define CTE_PADHVSWEN3_bp  3  /* Pad hvsw Enable bit 3 position. */
#define CTE_PADHVSWEN4_bm  (1<<4)  /* Pad hvsw Enable bit 4 mask. */
#define CTE_PADHVSWEN4_bp  4  /* Pad hvsw Enable bit 4 position. */
#define CTE_PADHVSWEN5_bm  (1<<5)  /* Pad hvsw Enable bit 5 mask. */
#define CTE_PADHVSWEN5_bp  5  /* Pad hvsw Enable bit 5 position. */
#define CTE_PADHVSWEN6_bm  (1<<6)  /* Pad hvsw Enable bit 6 mask. */
#define CTE_PADHVSWEN6_bp  6  /* Pad hvsw Enable bit 6 position. */
#define CTE_PADHVSWEN7_bm  (1<<7)  /* Pad hvsw Enable bit 7 mask. */
#define CTE_PADHVSWEN7_bp  7  /* Pad hvsw Enable bit 7 position. */
#define CTE_PADHVSWEN8_bm  (1<<8)  /* Pad hvsw Enable bit 8 mask. */
#define CTE_PADHVSWEN8_bp  8  /* Pad hvsw Enable bit 8 position. */
#define CTE_PADHVSWEN9_bm  (1<<9)  /* Pad hvsw Enable bit 9 mask. */
#define CTE_PADHVSWEN9_bp  9  /* Pad hvsw Enable bit 9 position. */
#define CTE_PADHVSWEN10_bm  (1<<10)  /* Pad hvsw Enable bit 10 mask. */
#define CTE_PADHVSWEN10_bp  10  /* Pad hvsw Enable bit 10 position. */
#define CTE_PADHVSWEN11_bm  (1<<11)  /* Pad hvsw Enable bit 11 mask. */
#define CTE_PADHVSWEN11_bp  11  /* Pad hvsw Enable bit 11 position. */
#define CTE_PADHVSWEN12_bm  (1<<12)  /* Pad hvsw Enable bit 12 mask. */
#define CTE_PADHVSWEN12_bp  12  /* Pad hvsw Enable bit 12 position. */
#define CTE_PADHVSWEN13_bm  (1<<13)  /* Pad hvsw Enable bit 13 mask. */
#define CTE_PADHVSWEN13_bp  13  /* Pad hvsw Enable bit 13 position. */
#define CTE_PADHVSWEN14_bm  (1<<14)  /* Pad hvsw Enable bit 14 mask. */
#define CTE_PADHVSWEN14_bp  14  /* Pad hvsw Enable bit 14 position. */
#define CTE_PADHVSWEN15_bm  (1<<15)  /* Pad hvsw Enable bit 15 mask. */
#define CTE_PADHVSWEN15_bp  15  /* Pad hvsw Enable bit 15 position. */

/* CTE.PADHVSWENB  bit masks and bit positions */
/* CTE_PADHVSWEN  is already defined. */

/* CTE.PADBNX1  bit masks and bit positions */
#define CTE_SCBNX1A_gm  0xFF  /* Current source nmos calibration X1 A group mask. */
#define CTE_SCBNX1A_gp  0  /* Current source nmos calibration X1 A group position. */
#define CTE_SCBNX1A0_bm  (1<<0)  /* Current source nmos calibration X1 A bit 0 mask. */
#define CTE_SCBNX1A0_bp  0  /* Current source nmos calibration X1 A bit 0 position. */
#define CTE_SCBNX1A1_bm  (1<<1)  /* Current source nmos calibration X1 A bit 1 mask. */
#define CTE_SCBNX1A1_bp  1  /* Current source nmos calibration X1 A bit 1 position. */
#define CTE_SCBNX1A2_bm  (1<<2)  /* Current source nmos calibration X1 A bit 2 mask. */
#define CTE_SCBNX1A2_bp  2  /* Current source nmos calibration X1 A bit 2 position. */
#define CTE_SCBNX1A3_bm  (1<<3)  /* Current source nmos calibration X1 A bit 3 mask. */
#define CTE_SCBNX1A3_bp  3  /* Current source nmos calibration X1 A bit 3 position. */
#define CTE_SCBNX1A4_bm  (1<<4)  /* Current source nmos calibration X1 A bit 4 mask. */
#define CTE_SCBNX1A4_bp  4  /* Current source nmos calibration X1 A bit 4 position. */
#define CTE_SCBNX1A5_bm  (1<<5)  /* Current source nmos calibration X1 A bit 5 mask. */
#define CTE_SCBNX1A5_bp  5  /* Current source nmos calibration X1 A bit 5 position. */
#define CTE_SCBNX1A6_bm  (1<<6)  /* Current source nmos calibration X1 A bit 6 mask. */
#define CTE_SCBNX1A6_bp  6  /* Current source nmos calibration X1 A bit 6 position. */
#define CTE_SCBNX1A7_bm  (1<<7)  /* Current source nmos calibration X1 A bit 7 mask. */
#define CTE_SCBNX1A7_bp  7  /* Current source nmos calibration X1 A bit 7 position. */
#define CTE_SCBNX1B_gm  0xFF00  /* Current source nmos calibration X1 B group mask. */
#define CTE_SCBNX1B_gp  8  /* Current source nmos calibration X1 B group position. */
#define CTE_SCBNX1B0_bm  (1<<8)  /* Current source nmos calibration X1 B bit 0 mask. */
#define CTE_SCBNX1B0_bp  8  /* Current source nmos calibration X1 B bit 0 position. */
#define CTE_SCBNX1B1_bm  (1<<9)  /* Current source nmos calibration X1 B bit 1 mask. */
#define CTE_SCBNX1B1_bp  9  /* Current source nmos calibration X1 B bit 1 position. */
#define CTE_SCBNX1B2_bm  (1<<10)  /* Current source nmos calibration X1 B bit 2 mask. */
#define CTE_SCBNX1B2_bp  10  /* Current source nmos calibration X1 B bit 2 position. */
#define CTE_SCBNX1B3_bm  (1<<11)  /* Current source nmos calibration X1 B bit 3 mask. */
#define CTE_SCBNX1B3_bp  11  /* Current source nmos calibration X1 B bit 3 position. */
#define CTE_SCBNX1B4_bm  (1<<12)  /* Current source nmos calibration X1 B bit 4 mask. */
#define CTE_SCBNX1B4_bp  12  /* Current source nmos calibration X1 B bit 4 position. */
#define CTE_SCBNX1B5_bm  (1<<13)  /* Current source nmos calibration X1 B bit 5 mask. */
#define CTE_SCBNX1B5_bp  13  /* Current source nmos calibration X1 B bit 5 position. */
#define CTE_SCBNX1B6_bm  (1<<14)  /* Current source nmos calibration X1 B bit 6 mask. */
#define CTE_SCBNX1B6_bp  14  /* Current source nmos calibration X1 B bit 6 position. */
#define CTE_SCBNX1B7_bm  (1<<15)  /* Current source nmos calibration X1 B bit 7 mask. */
#define CTE_SCBNX1B7_bp  15  /* Current source nmos calibration X1 B bit 7 position. */

