gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PADBNX2  bit masks and bit positions */
#define CTE_SCBNX2A_gm  0xFF  /* Current source nmos calibration X2 A group mask. */
#define CTE_SCBNX2A_gp  0  /* Current source nmos calibration X2 A group position. */
#define CTE_SCBNX2A0_bm  (1<<0)  /* Current source nmos calibration X2 A bit 0 mask. */
#define CTE_SCBNX2A0_bp  0  /* Current source nmos calibration X2 A bit 0 position. */
#define CTE_SCBNX2A1_bm  (1<<1)  /* Current source nmos calibration X2 A bit 1 mask. */
#define CTE_SCBNX2A1_bp  1  /* Current source nmos calibration X2 A bit 1 position. */
#define CTE_SCBNX2A2_bm  (1<<2)  /* Current source nmos calibration X2 A bit 2 mask. */
#define CTE_SCBNX2A2_bp  2  /* Current source nmos calibration X2 A bit 2 position. */
#define CTE_SCBNX2A3_bm  (1<<3)  /* Current source nmos calibration X2 A bit 3 mask. */
#define CTE_SCBNX2A3_bp  3  /* Current source nmos calibration X2 A bit 3 position. */
#define CTE_SCBNX2A4_bm  (1<<4)  /* Current source nmos calibration X2 A bit 4 mask. */
#define CTE_SCBNX2A4_bp  4  /* Current source nmos calibration X2 A bit 4 position. */
#define CTE_SCBNX2A5_bm  (1<<5)  /* Current source nmos calibration X2 A bit 5 mask. */
#define CTE_SCBNX2A5_bp  5  /* Current source nmos calibration X2 A bit 5 position. */
#define CTE_SCBNX2A6_bm  (1<<6)  /* Current source nmos calibration X2 A bit 6 mask. */
#define CTE_SCBNX2A6_bp  6  /* Current source nmos calibration X2 A bit 6 position. */
#define CTE_SCBNX2A7_bm  (1<<7)  /* Current source nmos calibration X2 A bit 7 mask. */
#define CTE_SCBNX2A7_bp  7  /* Current source nmos calibration X2 A bit 7 position. */
#define CTE_SCBNX2B_gm  0xFF00  /* Current source nmos calibration X2 B group mask. */
#define CTE_SCBNX2B_gp  8  /* Current source nmos calibration X2 B group position. */
#define CTE_SCBNX2B0_bm  (1<<8)  /* Current source nmos calibration X2 B bit 0 mask. */
#define CTE_SCBNX2B0_bp  8  /* Current source nmos calibration X2 B bit 0 position. */
#define CTE_SCBNX2B1_bm  (1<<9)  /* Current source nmos calibration X2 B bit 1 mask. */
#define CTE_SCBNX2B1_bp  9  /* Current source nmos calibration X2 B bit 1 position. */
#define CTE_SCBNX2B2_bm  (1<<10)  /* Current source nmos calibration X2 B bit 2 mask. */
#define CTE_SCBNX2B2_bp  10  /* Current source nmos calibration X2 B bit 2 position. */
#define CTE_SCBNX2B3_bm  (1<<11)  /* Current source nmos calibration X2 B bit 3 mask. */
#define CTE_SCBNX2B3_bp  11  /* Current source nmos calibration X2 B bit 3 position. */
#define CTE_SCBNX2B4_bm  (1<<12)  /* Current source nmos calibration X2 B bit 4 mask. */
#define CTE_SCBNX2B4_bp  12  /* Current source nmos calibration X2 B bit 4 position. */
#define CTE_SCBNX2B5_bm  (1<<13)  /* Current source nmos calibration X2 B bit 5 mask. */
#define CTE_SCBNX2B5_bp  13  /* Current source nmos calibration X2 B bit 5 position. */
#define CTE_SCBNX2B6_bm  (1<<14)  /* Current source nmos calibration X2 B bit 6 mask. */
#define CTE_SCBNX2B6_bp  14  /* Current source nmos calibration X2 B bit 6 position. */
#define CTE_SCBNX2B7_bm  (1<<15)  /* Current source nmos calibration X2 B bit 7 mask. */
#define CTE_SCBNX2B7_bp  15  /* Current source nmos calibration X2 B bit 7 position. */

/* CTE.PADBPX2  bit masks and bit positions */
#define CTE_SCBPX2A_gm  0xFF  /* Current source pmos calibration X2 A group mask. */
#define CTE_SCBPX2A_gp  0  /* Current source pmos calibration X2 A group position. */
#define CTE_SCBPX2A0_bm  (1<<0)  /* Current source pmos calibration X2 A bit 0 mask. */
#define CTE_SCBPX2A0_bp  0  /* Current source pmos calibration X2 A bit 0 position. */
#define CTE_SCBPX2A1_bm  (1<<1)  /* Current source pmos calibration X2 A bit 1 mask. */
#define CTE_SCBPX2A1_bp  1  /* Current source pmos calibration X2 A bit 1 position. */
#define CTE_SCBPX2A2_bm  (1<<2)  /* Current source pmos calibration X2 A bit 2 mask. */
#define CTE_SCBPX2A2_bp  2  /* Current source pmos calibration X2 A bit 2 position. */
#define CTE_SCBPX2A3_bm  (1<<3)  /* Current source pmos calibration X2 A bit 3 mask. */
#define CTE_SCBPX2A3_bp  3  /* Current source pmos calibration X2 A bit 3 position. */
#define CTE_SCBPX2A4_bm  (1<<4)  /* Current source pmos calibration X2 A bit 4 mask. */
#define CTE_SCBPX2A4_bp  4  /* Current source pmos calibration X2 A bit 4 position. */
#define CTE_SCBPX2A5_bm  (1<<5)  /* Current source pmos calibration X2 A bit 5 mask. */
#define CTE_SCBPX2A5_bp  5  /* Current source pmos calibration X2 A bit 5 position. */
#define CTE_SCBPX2A6_bm  (1<<6)  /* Current source pmos calibration X2 A bit 6 mask. */
#define CTE_SCBPX2A6_bp  6  /* Current source pmos calibration X2 A bit 6 position. */
#define CTE_SCBPX2A7_bm  (1<<7)  /* Current source pmos calibration X2 A bit 7 mask. */
#define CTE_SCBPX2A7_bp  7  /* Current source pmos calibration X2 A bit 7 position. */
#define CTE_SCBPX2B_gm  0xFF00  /* Current source pmos calibration X2 B group mask. */
#define CTE_SCBPX2B_gp  8  /* Current source pmos calibration X2 B group position. */
#define CTE_SCBPX2B0_bm  (1<<8)  /* Current source pmos calibration X2 B bit 0 mask. */
#define CTE_SCBPX2B0_bp  8  /* Current source pmos calibration X2 B bit 0 position. */
#define CTE_SCBPX2B1_bm  (1<<9)  /* Current source pmos calibration X2 B bit 1 mask. */
#define CTE_SCBPX2B1_bp  9  /* Current source pmos calibration X2 B bit 1 position. */
#define CTE_SCBPX2B2_bm  (1<<10)  /* Current source pmos calibration X2 B bit 2 mask. */
#define CTE_SCBPX2B2_bp  10  /* Current source pmos calibration X2 B bit 2 position. */
#define CTE_SCBPX2B3_bm  (1<<11)  /* Current source pmos calibration X2 B bit 3 mask. */
#define CTE_SCBPX2B3_bp  11  /* Current source pmos calibration X2 B bit 3 position. */
#define CTE_SCBPX2B4_bm  (1<<12)  /* Current source pmos calibration X2 B bit 4 mask. */
#define CTE_SCBPX2B4_bp  12  /* Current source pmos calibration X2 B bit 4 position. */
#define CTE_SCBPX2B5_bm  (1<<13)  /* Current source pmos calibration X2 B bit 5 mask. */
#define CTE_SCBPX2B5_bp  13  /* Current source pmos calibration X2 B bit 5 position. */
#define CTE_SCBPX2B6_bm  (1<<14)  /* Current source pmos calibration X2 B bit 6 mask. */
#define CTE_SCBPX2B6_bp  14  /* Current source pmos calibration X2 B bit 6 position. */
#define CTE_SCBPX2B7_bm  (1<<15)  /* Current source pmos calibration X2 B bit 7 mask. */
#define CTE_SCBPX2B7_bp  15  /* Current source pmos calibration X2 B bit 7 position. */

/* CTE.PADX2  bit masks and bit positions */
/* CTE_SCEXTRAPXA  is already defined. */
/* CTE_SCEXTRAPXB  is already defined. */
/* CTE_SCEXTRANXA  is already defined. */
/* CTE_SCEXTRANXB  is already defined. */

