gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540sreva.h
/* CTE.PIFYSRLB  bit masks and bit positions */
/* CTE_PIFYSRL  is already defined. */

/* CTE.MS0PCL  bit masks and bit positions */
#define CTE_MSPC_gm  0xFF  /* MS PC group mask. */
#define CTE_MSPC_gp  0  /* MS PC group position. */
#define CTE_MSPC0_bm  (1<<0)  /* MS PC bit 0 mask. */
#define CTE_MSPC0_bp  0  /* MS PC bit 0 position. */
#define CTE_MSPC1_bm  (1<<1)  /* MS PC bit 1 mask. */
#define CTE_MSPC1_bp  1  /* MS PC bit 1 position. */
#define CTE_MSPC2_bm  (1<<2)  /* MS PC bit 2 mask. */
#define CTE_MSPC2_bp  2  /* MS PC bit 2 position. */
#define CTE_MSPC3_bm  (1<<3)  /* MS PC bit 3 mask. */
#define CTE_MSPC3_bp  3  /* MS PC bit 3 position. */
#define CTE_MSPC4_bm  (1<<4)  /* MS PC bit 4 mask. */
#define CTE_MSPC4_bp  4  /* MS PC bit 4 position. */
#define CTE_MSPC5_bm  (1<<5)  /* MS PC bit 5 mask. */
#define CTE_MSPC5_bp  5  /* MS PC bit 5 position. */
#define CTE_MSPC6_bm  (1<<6)  /* MS PC bit 6 mask. */
#define CTE_MSPC6_bp  6  /* MS PC bit 6 position. */
#define CTE_MSPC7_bm  (1<<7)  /* MS PC bit 7 mask. */
#define CTE_MSPC7_bp  7  /* MS PC bit 7 position. */

/* CTE.MS0PCH  bit masks and bit positions */
/* CTE_MSPC  is already defined. */

/* CTE.MS0HIF  bit masks and bit positions */
#define CTE_MSRUN_bm  0x01  /* MS Run bit mask. */
#define CTE_MSRUN_bp  0  /* MS Run bit position. */
#define CTE_MSSS_bm  0x02  /* MS Single Step bit mask. */
#define CTE_MSSS_bp  1  /* MS Single Step bit position. */
#define CTE_MSIF_bm  0x04  /* MS Interrupt Flag bit mask. */
#define CTE_MSIF_bp  2  /* MS Interrupt Flag bit position. */

/* CTE.MS0IR0  bit masks and bit positions */
#define CTE_MSIR_gm  0xFF  /* MS Instruction Register group mask. */
#define CTE_MSIR_gp  0  /* MS Instruction Register group position. */
#define CTE_MSIR0_bm  (1<<0)  /* MS Instruction Register bit 0 mask. */
#define CTE_MSIR0_bp  0  /* MS Instruction Register bit 0 position. */
#define CTE_MSIR1_bm  (1<<1)  /* MS Instruction Register bit 1 mask. */
#define CTE_MSIR1_bp  1  /* MS Instruction Register bit 1 position. */
#define CTE_MSIR2_bm  (1<<2)  /* MS Instruction Register bit 2 mask. */
#define CTE_MSIR2_bp  2  /* MS Instruction Register bit 2 position. */
#define CTE_MSIR3_bm  (1<<3)  /* MS Instruction Register bit 3 mask. */
#define CTE_MSIR3_bp  3  /* MS Instruction Register bit 3 position. */
#define CTE_MSIR4_bm  (1<<4)  /* MS Instruction Register bit 4 mask. */
#define CTE_MSIR4_bp  4  /* MS Instruction Register bit 4 position. */
#define CTE_MSIR5_bm  (1<<5)  /* MS Instruction Register bit 5 mask. */
#define CTE_MSIR5_bp  5  /* MS Instruction Register bit 5 position. */
#define CTE_MSIR6_bm  (1<<6)  /* MS Instruction Register bit 6 mask. */
#define CTE_MSIR6_bp  6  /* MS Instruction Register bit 6 position. */
#define CTE_MSIR7_bm  (1<<7)  /* MS Instruction Register bit 7 mask. */
#define CTE_MSIR7_bp  7  /* MS Instruction Register bit 7 position. */

/* CTE.MS0IR1  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS0IR2  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS0IR3  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS0IRBUFL  bit masks and bit positions */
#define CTE_MSIRBUF_gm  0xFF  /* MS Instruction Register Buffer group mask. */
#define CTE_MSIRBUF_gp  0  /* MS Instruction Register Buffer group position. */
#define CTE_MSIRBUF0_bm  (1<<0)  /* MS Instruction Register Buffer bit 0 mask. */
#define CTE_MSIRBUF0_bp  0  /* MS Instruction Register Buffer bit 0 position. */
#define CTE_MSIRBUF1_bm  (1<<1)  /* MS Instruction Register Buffer bit 1 mask. */
#define CTE_MSIRBUF1_bp  1  /* MS Instruction Register Buffer bit 1 position. */
#define CTE_MSIRBUF2_bm  (1<<2)  /* MS Instruction Register Buffer bit 2 mask. */
#define CTE_MSIRBUF2_bp  2  /* MS Instruction Register Buffer bit 2 position. */
#define CTE_MSIRBUF3_bm  (1<<3)  /* MS Instruction Register Buffer bit 3 mask. */
#define CTE_MSIRBUF3_bp  3  /* MS Instruction Register Buffer bit 3 position. */
#define CTE_MSIRBUF4_bm  (1<<4)  /* MS Instruction Register Buffer bit 4 mask. */
#define CTE_MSIRBUF4_bp  4  /* MS Instruction Register Buffer bit 4 position. */
#define CTE_MSIRBUF5_bm  (1<<5)  /* MS Instruction Register Buffer bit 5 mask. */
#define CTE_MSIRBUF5_bp  5  /* MS Instruction Register Buffer bit 5 position. */
#define CTE_MSIRBUF6_bm  (1<<6)  /* MS Instruction Register Buffer bit 6 mask. */
#define CTE_MSIRBUF6_bp  6  /* MS Instruction Register Buffer bit 6 position. */
#define CTE_MSIRBUF7_bm  (1<<7)  /* MS Instruction Register Buffer bit 7 mask. */
#define CTE_MSIRBUF7_bp  7  /* MS Instruction Register Buffer bit 7 position. */

/* CTE.MS0IRBUFH  bit masks and bit positions */
/* CTE_MSIRBUF  is already defined. */

/* CTE.MS0R0L  bit masks and bit positions */
#define CTE_MSR0_gm  0xFF  /* MS R0 in register file group mask. */
#define CTE_MSR0_gp  0  /* MS R0 in register file group position. */
#define CTE_MSR00_bm  (1<<0)  /* MS R0 in register file bit 0 mask. */
#define CTE_MSR00_bp  0  /* MS R0 in register file bit 0 position. */
#define CTE_MSR01_bm  (1<<1)  /* MS R0 in register file bit 1 mask. */
#define CTE_MSR01_bp  1  /* MS R0 in register file bit 1 position. */
#define CTE_MSR02_bm  (1<<2)  /* MS R0 in register file bit 2 mask. */
#define CTE_MSR02_bp  2  /* MS R0 in register file bit 2 position. */
#define CTE_MSR03_bm  (1<<3)  /* MS R0 in register file bit 3 mask. */
#define CTE_MSR03_bp  3  /* MS R0 in register file bit 3 position. */
#define CTE_MSR04_bm  (1<<4)  /* MS R0 in register file bit 4 mask. */
#define CTE_MSR04_bp  4  /* MS R0 in register file bit 4 position. */
#define CTE_MSR05_bm  (1<<5)  /* MS R0 in register file bit 5 mask. */
#define CTE_MSR05_bp  5  /* MS R0 in register file bit 5 position. */
#define CTE_MSR06_bm  (1<<6)  /* MS R0 in register file bit 6 mask. */
#define CTE_MSR06_bp  6  /* MS R0 in register file bit 6 position. */
#define CTE_MSR07_bm  (1<<7)  /* MS R0 in register file bit 7 mask. */
#define CTE_MSR07_bp  7  /* MS R0 in register file bit 7 position. */

/* CTE.MS0R0H  bit masks and bit positions */
/* CTE_MSR0  is already defined. */

/* CTE.MS0REPEATL  bit masks and bit positions */
#define CTE_MSREPEAT_gm  0xFF  /* MS Repeat Register group mask. */
#define CTE_MSREPEAT_gp  0  /* MS Repeat Register group position. */
#define CTE_MSREPEAT0_bm  (1<<0)  /* MS Repeat Register bit 0 mask. */
#define CTE_MSREPEAT0_bp  0  /* MS Repeat Register bit 0 position. */
#define CTE_MSREPEAT1_bm  (1<<1)  /* MS Repeat Register bit 1 mask. */
#define CTE_MSREPEAT1_bp  1  /* MS Repeat Register bit 1 position. */
#define CTE_MSREPEAT2_bm  (1<<2)  /* MS Repeat Register bit 2 mask. */
#define CTE_MSREPEAT2_bp  2  /* MS Repeat Register bit 2 position. */
#define CTE_MSREPEAT3_bm  (1<<3)  /* MS Repeat Register bit 3 mask. */
#define CTE_MSREPEAT3_bp  3  /* MS Repeat Register bit 3 position. */
#define CTE_MSREPEAT4_bm  (1<<4)  /* MS Repeat Register bit 4 mask. */
#define CTE_MSREPEAT4_bp  4  /* MS Repeat Register bit 4 position. */
#define CTE_MSREPEAT5_bm  (1<<5)  /* MS Repeat Register bit 5 mask. */
#define CTE_MSREPEAT5_bp  5  /* MS Repeat Register bit 5 position. */
#define CTE_MSREPEAT6_bm  (1<<6)  /* MS Repeat Register bit 6 mask. */
#define CTE_MSREPEAT6_bp  6  /* MS Repeat Register bit 6 position. */
#define CTE_MSREPEAT7_bm  (1<<7)  /* MS Repeat Register bit 7 mask. */
#define CTE_MSREPEAT7_bp  7  /* MS Repeat Register bit 7 position. */

/* CTE.MS0REPEATH  bit masks and bit positions */
/* CTE_MSREPEAT  is already defined. */

/* CTE.MS1PCL  bit masks and bit positions */
/* CTE_MSPC  is already defined. */

/* CTE.MS1PCH  bit masks and bit positions */
/* CTE_MSPC  is already defined. */

/* CTE.MS1HIF  bit masks and bit positions */
/* CTE_MSRUN  is already defined. */
/* CTE_MSSS  is already defined. */
/* CTE_MSIF  is already defined. */

/* CTE.MS1IR0  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS1IR1  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

